/* automatically generated by rust-bindgen 0.69.4 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const FLT_REGISTRATION_VERSION_0202: u32 = 514;
pub const FLT_REGISTRATION_VERSION_0203: u32 = 515;
pub const FLT_REGISTRATION_VERSION: u32 = 515;
pub const FLT_VALID_FILE_NAME_FORMATS: u32 = 255;
pub const FLT_FILE_NAME_NORMALIZED: u32 = 1;
pub const FLT_FILE_NAME_OPENED: u32 = 2;
pub const FLT_FILE_NAME_SHORT: u32 = 3;
pub const FLT_VALID_FILE_NAME_QUERY_METHODS: u32 = 65280;
pub const FLT_FILE_NAME_QUERY_DEFAULT: u32 = 256;
pub const FLT_FILE_NAME_QUERY_CACHE_ONLY: u32 = 512;
pub const FLT_FILE_NAME_QUERY_FILESYSTEM_ONLY: u32 = 768;
pub const FLT_FILE_NAME_QUERY_ALWAYS_ALLOW_CACHE_LOOKUP: u32 = 1024;
pub const FLT_VALID_FILE_NAME_FLAGS: u32 = 4278190080;
pub const FLT_FILE_NAME_REQUEST_FROM_CURRENT_PROVIDER: u32 = 16777216;
pub const FLT_FILE_NAME_DO_NOT_CACHE: u32 = 33554432;
pub const FLT_FILE_NAME_ALLOW_QUERY_ON_REPARSE: u32 = 67108864;
pub const FLT_MAX_DEVICE_REPARSE_ATTEMPTS: u32 = 64;
pub const FLT_FLUSH_TYPE_FLUSH_AND_PURGE: u32 = 1;
pub const FLT_FLUSH_TYPE_FILE_DATA_ONLY: u32 = 2;
pub const FLT_FLUSH_TYPE_NO_SYNC: u32 = 4;
pub const FLT_FLUSH_TYPE_DATA_SYNC_ONLY: u32 = 8;
pub const FLT_PORT_CONNECT: u32 = 1;
pub const FLT_PORT_ALL_ACCESS: u32 = 2031617;
pub const FLT_PUSH_LOCK_ENABLE_AUTO_BOOST: u32 = 1;
pub const FLT_PUSH_LOCK_DISABLE_AUTO_BOOST: u32 = 2;
pub const FLT_PUSH_LOCK_VALID_FLAGS: u32 = 3;
pub const FLT_MAX_TRANSACTION_NOTIFICATIONS: u32 = 1073741839;
pub type wchar_t = ::core::ffi::c_ushort;
pub type LONG_PTR = ::core::ffi::c_longlong;
pub type ULONG_PTR = ::core::ffi::c_ulonglong;
pub type PULONG_PTR = *mut ::core::ffi::c_ulonglong;
pub type SIZE_T = ULONG_PTR;
pub type LONG64 = ::core::ffi::c_longlong;
pub type KAFFINITY = ULONG_PTR;
pub type PVOID = *mut ::core::ffi::c_void;
pub type CHAR = ::core::ffi::c_char;
pub type SHORT = ::core::ffi::c_short;
pub type LONG = ::core::ffi::c_long;
pub type WCHAR = wchar_t;
pub type PWCH = *mut WCHAR;
pub type PWSTR = *mut WCHAR;
pub type PCHAR = *mut CHAR;
pub type PCSTR = *const CHAR;
pub type UCHAR = ::core::ffi::c_uchar;
pub type USHORT = ::core::ffi::c_ushort;
pub type ULONG = ::core::ffi::c_ulong;
pub type PULONG = *mut ULONG;
pub type HANDLE = *mut ::core::ffi::c_void;
pub type PHANDLE = *mut HANDLE;
pub type CCHAR = ::core::ffi::c_char;
pub type CSHORT = ::core::ffi::c_short;
pub type LCID = ULONG;
pub type NTSTATUS = LONG;
pub type LONGLONG = ::core::ffi::c_longlong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _LARGE_INTEGER {
    pub __bindgen_anon_1: _LARGE_INTEGER__bindgen_ty_1,
    pub u: _LARGE_INTEGER__bindgen_ty_2,
    pub QuadPart: LONGLONG,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _LARGE_INTEGER__bindgen_ty_1 {
    pub LowPart: ULONG,
    pub HighPart: LONG,
}
#[test]
fn bindgen_test_layout__LARGE_INTEGER__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_LARGE_INTEGER__bindgen_ty_1> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_LARGE_INTEGER__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_LARGE_INTEGER__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_LARGE_INTEGER__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_LARGE_INTEGER__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LowPart) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LARGE_INTEGER__bindgen_ty_1),
            "::",
            stringify!(LowPart),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HighPart) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_LARGE_INTEGER__bindgen_ty_1),
            "::",
            stringify!(HighPart),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _LARGE_INTEGER__bindgen_ty_2 {
    pub LowPart: ULONG,
    pub HighPart: LONG,
}
#[test]
fn bindgen_test_layout__LARGE_INTEGER__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<_LARGE_INTEGER__bindgen_ty_2> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_LARGE_INTEGER__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(_LARGE_INTEGER__bindgen_ty_2)),
    );
    assert_eq!(
        ::core::mem::align_of::<_LARGE_INTEGER__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(_LARGE_INTEGER__bindgen_ty_2)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LowPart) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LARGE_INTEGER__bindgen_ty_2),
            "::",
            stringify!(LowPart),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HighPart) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_LARGE_INTEGER__bindgen_ty_2),
            "::",
            stringify!(HighPart),
        ),
    );
}
#[test]
fn bindgen_test_layout__LARGE_INTEGER() {
    const UNINIT: ::core::mem::MaybeUninit<_LARGE_INTEGER> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_LARGE_INTEGER>(),
        8usize,
        concat!("Size of: ", stringify!(_LARGE_INTEGER)),
    );
    assert_eq!(
        ::core::mem::align_of::<_LARGE_INTEGER>(),
        8usize,
        concat!("Alignment of ", stringify!(_LARGE_INTEGER)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_LARGE_INTEGER), "::", stringify!(u)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).QuadPart) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LARGE_INTEGER),
            "::",
            stringify!(QuadPart),
        ),
    );
}
impl Default for _LARGE_INTEGER {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type LARGE_INTEGER = _LARGE_INTEGER;
pub type PLARGE_INTEGER = *mut LARGE_INTEGER;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _LUID {
    pub LowPart: ULONG,
    pub HighPart: LONG,
}
#[test]
fn bindgen_test_layout__LUID() {
    const UNINIT: ::core::mem::MaybeUninit<_LUID> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_LUID>(),
        8usize,
        concat!("Size of: ", stringify!(_LUID)),
    );
    assert_eq!(
        ::core::mem::align_of::<_LUID>(),
        4usize,
        concat!("Alignment of ", stringify!(_LUID)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LowPart) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_LUID), "::", stringify!(LowPart)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HighPart) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(_LUID), "::", stringify!(HighPart)),
    );
}
pub type LUID = _LUID;
pub type PHYSICAL_ADDRESS = LARGE_INTEGER;
pub mod _WAIT_TYPE {
    pub type Type = ::core::ffi::c_int;
    pub const WaitAll: Type = 0;
    pub const WaitAny: Type = 1;
    pub const WaitNotification: Type = 2;
    pub const WaitDequeue: Type = 3;
    pub const WaitDpc: Type = 4;
}
pub use self::_WAIT_TYPE::Type as WAIT_TYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _STRING {
    pub Length: USHORT,
    pub MaximumLength: USHORT,
    pub Buffer: PCHAR,
}
#[test]
fn bindgen_test_layout__STRING() {
    const UNINIT: ::core::mem::MaybeUninit<_STRING> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_STRING>(),
        16usize,
        concat!("Size of: ", stringify!(_STRING)),
    );
    assert_eq!(
        ::core::mem::align_of::<_STRING>(),
        8usize,
        concat!("Alignment of ", stringify!(_STRING)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_STRING), "::", stringify!(Length)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MaximumLength) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_STRING),
            "::",
            stringify!(MaximumLength),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Buffer) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(_STRING), "::", stringify!(Buffer)),
    );
}
impl Default for _STRING {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type STRING = _STRING;
pub type PSTRING = *mut STRING;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _UNICODE_STRING {
    pub Length: USHORT,
    pub MaximumLength: USHORT,
    pub Buffer: PWCH,
}
#[test]
fn bindgen_test_layout__UNICODE_STRING() {
    const UNINIT: ::core::mem::MaybeUninit<_UNICODE_STRING> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_UNICODE_STRING>(),
        16usize,
        concat!("Size of: ", stringify!(_UNICODE_STRING)),
    );
    assert_eq!(
        ::core::mem::align_of::<_UNICODE_STRING>(),
        8usize,
        concat!("Alignment of ", stringify!(_UNICODE_STRING)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_UNICODE_STRING),
            "::",
            stringify!(Length),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MaximumLength) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_UNICODE_STRING),
            "::",
            stringify!(MaximumLength),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Buffer) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_UNICODE_STRING),
            "::",
            stringify!(Buffer),
        ),
    );
}
impl Default for _UNICODE_STRING {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type UNICODE_STRING = _UNICODE_STRING;
pub type PUNICODE_STRING = *mut UNICODE_STRING;
pub type PCUNICODE_STRING = *const UNICODE_STRING;
pub type BOOLEAN = UCHAR;
pub type PBOOLEAN = *mut BOOLEAN;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LIST_ENTRY {
    pub Flink: *mut _LIST_ENTRY,
    pub Blink: *mut _LIST_ENTRY,
}
#[test]
fn bindgen_test_layout__LIST_ENTRY() {
    const UNINIT: ::core::mem::MaybeUninit<_LIST_ENTRY> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_LIST_ENTRY>(),
        16usize,
        concat!("Size of: ", stringify!(_LIST_ENTRY)),
    );
    assert_eq!(
        ::core::mem::align_of::<_LIST_ENTRY>(),
        8usize,
        concat!("Alignment of ", stringify!(_LIST_ENTRY)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Flink) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_LIST_ENTRY), "::", stringify!(Flink)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Blink) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(_LIST_ENTRY), "::", stringify!(Blink)),
    );
}
impl Default for _LIST_ENTRY {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type LIST_ENTRY = _LIST_ENTRY;
pub type PLIST_ENTRY = *mut _LIST_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SINGLE_LIST_ENTRY {
    pub Next: *mut _SINGLE_LIST_ENTRY,
}
#[test]
fn bindgen_test_layout__SINGLE_LIST_ENTRY() {
    const UNINIT: ::core::mem::MaybeUninit<_SINGLE_LIST_ENTRY> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SINGLE_LIST_ENTRY>(),
        8usize,
        concat!("Size of: ", stringify!(_SINGLE_LIST_ENTRY)),
    );
    assert_eq!(
        ::core::mem::align_of::<_SINGLE_LIST_ENTRY>(),
        8usize,
        concat!("Alignment of ", stringify!(_SINGLE_LIST_ENTRY)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SINGLE_LIST_ENTRY),
            "::",
            stringify!(Next),
        ),
    );
}
impl Default for _SINGLE_LIST_ENTRY {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type SINGLE_LIST_ENTRY = _SINGLE_LIST_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _OBJECT_ATTRIBUTES {
    pub Length: ULONG,
    pub RootDirectory: HANDLE,
    pub ObjectName: PUNICODE_STRING,
    pub Attributes: ULONG,
    pub SecurityDescriptor: PVOID,
    pub SecurityQualityOfService: PVOID,
}
#[test]
fn bindgen_test_layout__OBJECT_ATTRIBUTES() {
    const UNINIT: ::core::mem::MaybeUninit<_OBJECT_ATTRIBUTES> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_OBJECT_ATTRIBUTES>(),
        48usize,
        concat!("Size of: ", stringify!(_OBJECT_ATTRIBUTES)),
    );
    assert_eq!(
        ::core::mem::align_of::<_OBJECT_ATTRIBUTES>(),
        8usize,
        concat!("Alignment of ", stringify!(_OBJECT_ATTRIBUTES)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_OBJECT_ATTRIBUTES),
            "::",
            stringify!(Length),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RootDirectory) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_OBJECT_ATTRIBUTES),
            "::",
            stringify!(RootDirectory),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ObjectName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_OBJECT_ATTRIBUTES),
            "::",
            stringify!(ObjectName),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Attributes) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_OBJECT_ATTRIBUTES),
            "::",
            stringify!(Attributes),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SecurityDescriptor) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_OBJECT_ATTRIBUTES),
            "::",
            stringify!(SecurityDescriptor),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SecurityQualityOfService) as usize
                - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_OBJECT_ATTRIBUTES),
            "::",
            stringify!(SecurityQualityOfService),
        ),
    );
}
impl Default for _OBJECT_ATTRIBUTES {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type OBJECT_ATTRIBUTES = _OBJECT_ATTRIBUTES;
pub type POBJECT_ATTRIBUTES = *mut OBJECT_ATTRIBUTES;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _GUID {
    pub Data1: ::core::ffi::c_ulong,
    pub Data2: ::core::ffi::c_ushort,
    pub Data3: ::core::ffi::c_ushort,
    pub Data4: [::core::ffi::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout__GUID() {
    const UNINIT: ::core::mem::MaybeUninit<_GUID> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_GUID>(),
        16usize,
        concat!("Size of: ", stringify!(_GUID)),
    );
    assert_eq!(
        ::core::mem::align_of::<_GUID>(),
        4usize,
        concat!("Alignment of ", stringify!(_GUID)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Data1) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_GUID), "::", stringify!(Data1)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Data2) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(_GUID), "::", stringify!(Data2)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Data3) as usize - ptr as usize },
        6usize,
        concat!("Offset of field: ", stringify!(_GUID), "::", stringify!(Data3)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Data4) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(_GUID), "::", stringify!(Data4)),
    );
}
pub type GUID = _GUID;
pub type LPGUID = *mut GUID;
pub type LPCGUID = *const GUID;
pub type KIRQL = UCHAR;
pub type PKIRQL = *mut KIRQL;
pub type PACCESS_STATE = *mut _ACCESS_STATE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _KPROCESS {
    _unused: [u8; 0],
}
pub type PEPROCESS = *mut _KPROCESS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _KTHREAD {
    _unused: [u8; 0],
}
pub type PETHREAD = *mut _KTHREAD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_TIMER {
    _unused: [u8; 0],
}
pub type PIO_TIMER = *mut _IO_TIMER;
pub type PSECURITY_QUALITY_OF_SERVICE = *mut _SECURITY_QUALITY_OF_SERVICE;
pub type PVPB = *mut _VPB;
pub type PFILE_GET_QUOTA_INFORMATION = *mut _FILE_GET_QUOTA_INFORMATION;
pub type KSPIN_LOCK = ULONG_PTR;
pub type PACCESS_TOKEN = PVOID;
pub type PSECURITY_DESCRIPTOR = PVOID;
pub type PSID = PVOID;
pub type ACCESS_MASK = ULONG;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _LUID_AND_ATTRIBUTES {
    pub Luid: LUID,
    pub Attributes: ULONG,
}
#[test]
fn bindgen_test_layout__LUID_AND_ATTRIBUTES() {
    const UNINIT: ::core::mem::MaybeUninit<_LUID_AND_ATTRIBUTES> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_LUID_AND_ATTRIBUTES>(),
        12usize,
        concat!("Size of: ", stringify!(_LUID_AND_ATTRIBUTES)),
    );
    assert_eq!(
        ::core::mem::align_of::<_LUID_AND_ATTRIBUTES>(),
        4usize,
        concat!("Alignment of ", stringify!(_LUID_AND_ATTRIBUTES)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Luid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LUID_AND_ATTRIBUTES),
            "::",
            stringify!(Luid),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Attributes) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_LUID_AND_ATTRIBUTES),
            "::",
            stringify!(Attributes),
        ),
    );
}
pub type LUID_AND_ATTRIBUTES = _LUID_AND_ATTRIBUTES;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _PRIVILEGE_SET {
    pub PrivilegeCount: ULONG,
    pub Control: ULONG,
    pub Privilege: [LUID_AND_ATTRIBUTES; 1usize],
}
#[test]
fn bindgen_test_layout__PRIVILEGE_SET() {
    const UNINIT: ::core::mem::MaybeUninit<_PRIVILEGE_SET> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_PRIVILEGE_SET>(),
        20usize,
        concat!("Size of: ", stringify!(_PRIVILEGE_SET)),
    );
    assert_eq!(
        ::core::mem::align_of::<_PRIVILEGE_SET>(),
        4usize,
        concat!("Alignment of ", stringify!(_PRIVILEGE_SET)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PrivilegeCount) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_PRIVILEGE_SET),
            "::",
            stringify!(PrivilegeCount),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Control) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_PRIVILEGE_SET),
            "::",
            stringify!(Control),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Privilege) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_PRIVILEGE_SET),
            "::",
            stringify!(Privilege),
        ),
    );
}
pub type PRIVILEGE_SET = _PRIVILEGE_SET;
pub mod _SECURITY_IMPERSONATION_LEVEL {
    pub type Type = ::core::ffi::c_int;
    pub const SecurityAnonymous: Type = 0;
    pub const SecurityIdentification: Type = 1;
    pub const SecurityImpersonation: Type = 2;
    pub const SecurityDelegation: Type = 3;
}
pub use self::_SECURITY_IMPERSONATION_LEVEL::Type as SECURITY_IMPERSONATION_LEVEL;
pub type SECURITY_CONTEXT_TRACKING_MODE = BOOLEAN;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_QUALITY_OF_SERVICE {
    pub Length: ULONG,
    pub ImpersonationLevel: SECURITY_IMPERSONATION_LEVEL,
    pub ContextTrackingMode: SECURITY_CONTEXT_TRACKING_MODE,
    pub EffectiveOnly: BOOLEAN,
}
#[test]
fn bindgen_test_layout__SECURITY_QUALITY_OF_SERVICE() {
    const UNINIT: ::core::mem::MaybeUninit<_SECURITY_QUALITY_OF_SERVICE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SECURITY_QUALITY_OF_SERVICE>(),
        12usize,
        concat!("Size of: ", stringify!(_SECURITY_QUALITY_OF_SERVICE)),
    );
    assert_eq!(
        ::core::mem::align_of::<_SECURITY_QUALITY_OF_SERVICE>(),
        4usize,
        concat!("Alignment of ", stringify!(_SECURITY_QUALITY_OF_SERVICE)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_QUALITY_OF_SERVICE),
            "::",
            stringify!(Length),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ImpersonationLevel) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_QUALITY_OF_SERVICE),
            "::",
            stringify!(ImpersonationLevel),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ContextTrackingMode) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_QUALITY_OF_SERVICE),
            "::",
            stringify!(ContextTrackingMode),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EffectiveOnly) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_QUALITY_OF_SERVICE),
            "::",
            stringify!(EffectiveOnly),
        ),
    );
}
impl Default for _SECURITY_QUALITY_OF_SERVICE {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type SECURITY_INFORMATION = ULONG;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_STATUS_BLOCK {
    pub __bindgen_anon_1: _IO_STATUS_BLOCK__bindgen_ty_1,
    pub Information: ULONG_PTR,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _IO_STATUS_BLOCK__bindgen_ty_1 {
    pub Status: NTSTATUS,
    pub Pointer: PVOID,
}
#[test]
fn bindgen_test_layout__IO_STATUS_BLOCK__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_IO_STATUS_BLOCK__bindgen_ty_1> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_STATUS_BLOCK__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_IO_STATUS_BLOCK__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_STATUS_BLOCK__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_STATUS_BLOCK__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_STATUS_BLOCK__bindgen_ty_1),
            "::",
            stringify!(Status),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Pointer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_STATUS_BLOCK__bindgen_ty_1),
            "::",
            stringify!(Pointer),
        ),
    );
}
impl Default for _IO_STATUS_BLOCK__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__IO_STATUS_BLOCK() {
    const UNINIT: ::core::mem::MaybeUninit<_IO_STATUS_BLOCK> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_STATUS_BLOCK>(),
        16usize,
        concat!("Size of: ", stringify!(_IO_STATUS_BLOCK)),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_STATUS_BLOCK>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_STATUS_BLOCK)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Information) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_STATUS_BLOCK),
            "::",
            stringify!(Information),
        ),
    );
}
impl Default for _IO_STATUS_BLOCK {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type IO_STATUS_BLOCK = _IO_STATUS_BLOCK;
pub type PIO_STATUS_BLOCK = *mut _IO_STATUS_BLOCK;
pub type PIO_APC_ROUTINE = ::core::option::Option<
    unsafe extern "C" fn(
        ApcContext: PVOID,
        IoStatusBlock: PIO_STATUS_BLOCK,
        Reserved: ULONG,
    ),
>;
pub mod _FILE_INFORMATION_CLASS {
    pub type Type = ::core::ffi::c_int;
    pub const FileDirectoryInformation: Type = 1;
    pub const FileFullDirectoryInformation: Type = 2;
    pub const FileBothDirectoryInformation: Type = 3;
    pub const FileBasicInformation: Type = 4;
    pub const FileStandardInformation: Type = 5;
    pub const FileInternalInformation: Type = 6;
    pub const FileEaInformation: Type = 7;
    pub const FileAccessInformation: Type = 8;
    pub const FileNameInformation: Type = 9;
    pub const FileRenameInformation: Type = 10;
    pub const FileLinkInformation: Type = 11;
    pub const FileNamesInformation: Type = 12;
    pub const FileDispositionInformation: Type = 13;
    pub const FilePositionInformation: Type = 14;
    pub const FileFullEaInformation: Type = 15;
    pub const FileModeInformation: Type = 16;
    pub const FileAlignmentInformation: Type = 17;
    pub const FileAllInformation: Type = 18;
    pub const FileAllocationInformation: Type = 19;
    pub const FileEndOfFileInformation: Type = 20;
    pub const FileAlternateNameInformation: Type = 21;
    pub const FileStreamInformation: Type = 22;
    pub const FilePipeInformation: Type = 23;
    pub const FilePipeLocalInformation: Type = 24;
    pub const FilePipeRemoteInformation: Type = 25;
    pub const FileMailslotQueryInformation: Type = 26;
    pub const FileMailslotSetInformation: Type = 27;
    pub const FileCompressionInformation: Type = 28;
    pub const FileObjectIdInformation: Type = 29;
    pub const FileCompletionInformation: Type = 30;
    pub const FileMoveClusterInformation: Type = 31;
    pub const FileQuotaInformation: Type = 32;
    pub const FileReparsePointInformation: Type = 33;
    pub const FileNetworkOpenInformation: Type = 34;
    pub const FileAttributeTagInformation: Type = 35;
    pub const FileTrackingInformation: Type = 36;
    pub const FileIdBothDirectoryInformation: Type = 37;
    pub const FileIdFullDirectoryInformation: Type = 38;
    pub const FileValidDataLengthInformation: Type = 39;
    pub const FileShortNameInformation: Type = 40;
    pub const FileIoCompletionNotificationInformation: Type = 41;
    pub const FileIoStatusBlockRangeInformation: Type = 42;
    pub const FileIoPriorityHintInformation: Type = 43;
    pub const FileSfioReserveInformation: Type = 44;
    pub const FileSfioVolumeInformation: Type = 45;
    pub const FileHardLinkInformation: Type = 46;
    pub const FileProcessIdsUsingFileInformation: Type = 47;
    pub const FileNormalizedNameInformation: Type = 48;
    pub const FileNetworkPhysicalNameInformation: Type = 49;
    pub const FileIdGlobalTxDirectoryInformation: Type = 50;
    pub const FileIsRemoteDeviceInformation: Type = 51;
    pub const FileUnusedInformation: Type = 52;
    pub const FileNumaNodeInformation: Type = 53;
    pub const FileStandardLinkInformation: Type = 54;
    pub const FileRemoteProtocolInformation: Type = 55;
    pub const FileRenameInformationBypassAccessCheck: Type = 56;
    pub const FileLinkInformationBypassAccessCheck: Type = 57;
    pub const FileVolumeNameInformation: Type = 58;
    pub const FileIdInformation: Type = 59;
    pub const FileIdExtdDirectoryInformation: Type = 60;
    pub const FileReplaceCompletionInformation: Type = 61;
    pub const FileHardLinkFullIdInformation: Type = 62;
    pub const FileIdExtdBothDirectoryInformation: Type = 63;
    pub const FileDispositionInformationEx: Type = 64;
    pub const FileRenameInformationEx: Type = 65;
    pub const FileRenameInformationExBypassAccessCheck: Type = 66;
    pub const FileDesiredStorageClassInformation: Type = 67;
    pub const FileStatInformation: Type = 68;
    pub const FileMemoryPartitionInformation: Type = 69;
    pub const FileStatLxInformation: Type = 70;
    pub const FileCaseSensitiveInformation: Type = 71;
    pub const FileLinkInformationEx: Type = 72;
    pub const FileLinkInformationExBypassAccessCheck: Type = 73;
    pub const FileStorageReserveIdInformation: Type = 74;
    pub const FileCaseSensitiveInformationForceAccessCheck: Type = 75;
    pub const FileKnownFolderInformation: Type = 76;
    pub const FileStatBasicInformation: Type = 77;
    pub const FileId64ExtdDirectoryInformation: Type = 78;
    pub const FileId64ExtdBothDirectoryInformation: Type = 79;
    pub const FileIdAllExtdDirectoryInformation: Type = 80;
    pub const FileIdAllExtdBothDirectoryInformation: Type = 81;
    pub const FileMaximumInformation: Type = 82;
}
pub use self::_FILE_INFORMATION_CLASS::Type as FILE_INFORMATION_CLASS;
pub mod _DIRECTORY_NOTIFY_INFORMATION_CLASS {
    pub type Type = ::core::ffi::c_int;
    pub const DirectoryNotifyInformation: Type = 1;
    pub const DirectoryNotifyExtendedInformation: Type = 2;
    pub const DirectoryNotifyFullInformation: Type = 3;
    pub const DirectoryNotifyMaximumInformation: Type = 4;
}
pub use self::_DIRECTORY_NOTIFY_INFORMATION_CLASS::Type as DIRECTORY_NOTIFY_INFORMATION_CLASS;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _FILE_BASIC_INFORMATION {
    pub CreationTime: LARGE_INTEGER,
    pub LastAccessTime: LARGE_INTEGER,
    pub LastWriteTime: LARGE_INTEGER,
    pub ChangeTime: LARGE_INTEGER,
    pub FileAttributes: ULONG,
}
#[test]
fn bindgen_test_layout__FILE_BASIC_INFORMATION() {
    const UNINIT: ::core::mem::MaybeUninit<_FILE_BASIC_INFORMATION> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_FILE_BASIC_INFORMATION>(),
        40usize,
        concat!("Size of: ", stringify!(_FILE_BASIC_INFORMATION)),
    );
    assert_eq!(
        ::core::mem::align_of::<_FILE_BASIC_INFORMATION>(),
        8usize,
        concat!("Alignment of ", stringify!(_FILE_BASIC_INFORMATION)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CreationTime) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_BASIC_INFORMATION),
            "::",
            stringify!(CreationTime),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LastAccessTime) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_BASIC_INFORMATION),
            "::",
            stringify!(LastAccessTime),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LastWriteTime) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_BASIC_INFORMATION),
            "::",
            stringify!(LastWriteTime),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ChangeTime) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_BASIC_INFORMATION),
            "::",
            stringify!(ChangeTime),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FileAttributes) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_BASIC_INFORMATION),
            "::",
            stringify!(FileAttributes),
        ),
    );
}
impl Default for _FILE_BASIC_INFORMATION {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type PFILE_BASIC_INFORMATION = *mut _FILE_BASIC_INFORMATION;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _FILE_STANDARD_INFORMATION {
    pub AllocationSize: LARGE_INTEGER,
    pub EndOfFile: LARGE_INTEGER,
    pub NumberOfLinks: ULONG,
    pub DeletePending: BOOLEAN,
    pub Directory: BOOLEAN,
}
#[test]
fn bindgen_test_layout__FILE_STANDARD_INFORMATION() {
    const UNINIT: ::core::mem::MaybeUninit<_FILE_STANDARD_INFORMATION> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_FILE_STANDARD_INFORMATION>(),
        24usize,
        concat!("Size of: ", stringify!(_FILE_STANDARD_INFORMATION)),
    );
    assert_eq!(
        ::core::mem::align_of::<_FILE_STANDARD_INFORMATION>(),
        8usize,
        concat!("Alignment of ", stringify!(_FILE_STANDARD_INFORMATION)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AllocationSize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_STANDARD_INFORMATION),
            "::",
            stringify!(AllocationSize),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EndOfFile) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_STANDARD_INFORMATION),
            "::",
            stringify!(EndOfFile),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).NumberOfLinks) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_STANDARD_INFORMATION),
            "::",
            stringify!(NumberOfLinks),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DeletePending) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_STANDARD_INFORMATION),
            "::",
            stringify!(DeletePending),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Directory) as usize - ptr as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_STANDARD_INFORMATION),
            "::",
            stringify!(Directory),
        ),
    );
}
impl Default for _FILE_STANDARD_INFORMATION {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type PFILE_STANDARD_INFORMATION = *mut _FILE_STANDARD_INFORMATION;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _FILE_NETWORK_OPEN_INFORMATION {
    pub CreationTime: LARGE_INTEGER,
    pub LastAccessTime: LARGE_INTEGER,
    pub LastWriteTime: LARGE_INTEGER,
    pub ChangeTime: LARGE_INTEGER,
    pub AllocationSize: LARGE_INTEGER,
    pub EndOfFile: LARGE_INTEGER,
    pub FileAttributes: ULONG,
}
#[test]
fn bindgen_test_layout__FILE_NETWORK_OPEN_INFORMATION() {
    const UNINIT: ::core::mem::MaybeUninit<_FILE_NETWORK_OPEN_INFORMATION> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_FILE_NETWORK_OPEN_INFORMATION>(),
        56usize,
        concat!("Size of: ", stringify!(_FILE_NETWORK_OPEN_INFORMATION)),
    );
    assert_eq!(
        ::core::mem::align_of::<_FILE_NETWORK_OPEN_INFORMATION>(),
        8usize,
        concat!("Alignment of ", stringify!(_FILE_NETWORK_OPEN_INFORMATION)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CreationTime) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_NETWORK_OPEN_INFORMATION),
            "::",
            stringify!(CreationTime),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LastAccessTime) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_NETWORK_OPEN_INFORMATION),
            "::",
            stringify!(LastAccessTime),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LastWriteTime) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_NETWORK_OPEN_INFORMATION),
            "::",
            stringify!(LastWriteTime),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ChangeTime) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_NETWORK_OPEN_INFORMATION),
            "::",
            stringify!(ChangeTime),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AllocationSize) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_NETWORK_OPEN_INFORMATION),
            "::",
            stringify!(AllocationSize),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).EndOfFile) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_NETWORK_OPEN_INFORMATION),
            "::",
            stringify!(EndOfFile),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FileAttributes) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_FILE_NETWORK_OPEN_INFORMATION),
            "::",
            stringify!(FileAttributes),
        ),
    );
}
impl Default for _FILE_NETWORK_OPEN_INFORMATION {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type PFILE_NETWORK_OPEN_INFORMATION = *mut _FILE_NETWORK_OPEN_INFORMATION;
pub mod _IO_PRIORITY_HINT {
    pub type Type = ::core::ffi::c_int;
    pub const IoPriorityVeryLow: Type = 0;
    pub const IoPriorityLow: Type = 1;
    pub const IoPriorityNormal: Type = 2;
    pub const IoPriorityHigh: Type = 3;
    pub const IoPriorityCritical: Type = 4;
    pub const MaxIoPriorityTypes: Type = 5;
}
pub use self::_IO_PRIORITY_HINT::Type as IO_PRIORITY_HINT;
pub mod _FSINFOCLASS {
    pub type Type = ::core::ffi::c_int;
    pub const FileFsVolumeInformation: Type = 1;
    pub const FileFsLabelInformation: Type = 2;
    pub const FileFsSizeInformation: Type = 3;
    pub const FileFsDeviceInformation: Type = 4;
    pub const FileFsAttributeInformation: Type = 5;
    pub const FileFsControlInformation: Type = 6;
    pub const FileFsFullSizeInformation: Type = 7;
    pub const FileFsObjectIdInformation: Type = 8;
    pub const FileFsDriverPathInformation: Type = 9;
    pub const FileFsVolumeFlagsInformation: Type = 10;
    pub const FileFsSectorSizeInformation: Type = 11;
    pub const FileFsDataCopyInformation: Type = 12;
    pub const FileFsMetadataSizeInformation: Type = 13;
    pub const FileFsFullSizeInformationEx: Type = 14;
    pub const FileFsGuidInformation: Type = 15;
    pub const FileFsMaximumInformation: Type = 16;
}
pub use self::_FSINFOCLASS::Type as FS_INFORMATION_CLASS;
pub mod _INTERFACE_TYPE {
    pub type Type = ::core::ffi::c_int;
    pub const InterfaceTypeUndefined: Type = -1;
    pub const Internal: Type = 0;
    pub const Isa: Type = 1;
    pub const Eisa: Type = 2;
    pub const MicroChannel: Type = 3;
    pub const TurboChannel: Type = 4;
    pub const PCIBus: Type = 5;
    pub const VMEBus: Type = 6;
    pub const NuBus: Type = 7;
    pub const PCMCIABus: Type = 8;
    pub const CBus: Type = 9;
    pub const MPIBus: Type = 10;
    pub const MPSABus: Type = 11;
    pub const ProcessorInternal: Type = 12;
    pub const InternalPowerBus: Type = 13;
    pub const PNPISABus: Type = 14;
    pub const PNPBus: Type = 15;
    pub const Vmcs: Type = 16;
    pub const ACPIBus: Type = 17;
    pub const MaximumInterfaceType: Type = 18;
}
pub use self::_INTERFACE_TYPE::Type as INTERFACE_TYPE;
pub type PINTERFACE_REFERENCE = ::core::option::Option<
    unsafe extern "C" fn(Context: PVOID),
>;
pub type PINTERFACE_DEREFERENCE = ::core::option::Option<
    unsafe extern "C" fn(Context: PVOID),
>;
pub mod _SYSTEM_POWER_STATE {
    pub type Type = ::core::ffi::c_int;
    pub const PowerSystemUnspecified: Type = 0;
    pub const PowerSystemWorking: Type = 1;
    pub const PowerSystemSleeping1: Type = 2;
    pub const PowerSystemSleeping2: Type = 3;
    pub const PowerSystemSleeping3: Type = 4;
    pub const PowerSystemHibernate: Type = 5;
    pub const PowerSystemShutdown: Type = 6;
    pub const PowerSystemMaximum: Type = 7;
}
pub use self::_SYSTEM_POWER_STATE::Type as SYSTEM_POWER_STATE;
pub mod POWER_ACTION {
    pub type Type = ::core::ffi::c_int;
    pub const PowerActionNone: Type = 0;
    pub const PowerActionReserved: Type = 1;
    pub const PowerActionSleep: Type = 2;
    pub const PowerActionHibernate: Type = 3;
    pub const PowerActionShutdown: Type = 4;
    pub const PowerActionShutdownReset: Type = 5;
    pub const PowerActionShutdownOff: Type = 6;
    pub const PowerActionWarmEject: Type = 7;
    pub const PowerActionDisplayOff: Type = 8;
}
pub mod _DEVICE_POWER_STATE {
    pub type Type = ::core::ffi::c_int;
    pub const PowerDeviceUnspecified: Type = 0;
    pub const PowerDeviceD0: Type = 1;
    pub const PowerDeviceD1: Type = 2;
    pub const PowerDeviceD2: Type = 3;
    pub const PowerDeviceD3: Type = 4;
    pub const PowerDeviceMaximum: Type = 5;
}
pub use self::_DEVICE_POWER_STATE::Type as DEVICE_POWER_STATE;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _POWER_STATE {
    pub SystemState: SYSTEM_POWER_STATE,
    pub DeviceState: DEVICE_POWER_STATE,
}
#[test]
fn bindgen_test_layout__POWER_STATE() {
    const UNINIT: ::core::mem::MaybeUninit<_POWER_STATE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_POWER_STATE>(),
        4usize,
        concat!("Size of: ", stringify!(_POWER_STATE)),
    );
    assert_eq!(
        ::core::mem::align_of::<_POWER_STATE>(),
        4usize,
        concat!("Alignment of ", stringify!(_POWER_STATE)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SystemState) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_POWER_STATE),
            "::",
            stringify!(SystemState),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DeviceState) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_POWER_STATE),
            "::",
            stringify!(DeviceState),
        ),
    );
}
impl Default for _POWER_STATE {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type POWER_STATE = _POWER_STATE;
pub mod _POWER_STATE_TYPE {
    pub type Type = ::core::ffi::c_int;
    pub const SystemPowerState: Type = 0;
    pub const DevicePowerState: Type = 1;
}
pub use self::_POWER_STATE_TYPE::Type as POWER_STATE_TYPE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SYSTEM_POWER_STATE_CONTEXT {
    pub __bindgen_anon_1: _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1 {
    pub __bindgen_anon_1: _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1,
    pub ContextAsUlong: ULONG,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<
            _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        >(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1),
        ),
    );
}
impl _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn Reserved1(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_Reserved1(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn TargetSystemState(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_TargetSystemState(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn EffectiveSystemState(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_EffectiveSystemState(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn CurrentSystemState(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_CurrentSystemState(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn IgnoreHibernationPath(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_IgnoreHibernationPath(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn PseudoTransition(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_PseudoTransition(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn KernelSoftReboot(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_KernelSoftReboot(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn DirectedDripsTransition(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_DirectedDripsTransition(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Reserved2(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_Reserved2(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        Reserved1: ULONG,
        TargetSystemState: ULONG,
        EffectiveSystemState: ULONG,
        CurrentSystemState: ULONG,
        IgnoreHibernationPath: ULONG,
        PseudoTransition: ULONG,
        KernelSoftReboot: ULONG,
        DirectedDripsTransition: ULONG,
        Reserved2: ULONG,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                8u8,
                {
                    let Reserved1: u32 = unsafe { ::core::mem::transmute(Reserved1) };
                    Reserved1 as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                8usize,
                4u8,
                {
                    let TargetSystemState: u32 = unsafe {
                        ::core::mem::transmute(TargetSystemState)
                    };
                    TargetSystemState as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                12usize,
                4u8,
                {
                    let EffectiveSystemState: u32 = unsafe {
                        ::core::mem::transmute(EffectiveSystemState)
                    };
                    EffectiveSystemState as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                16usize,
                4u8,
                {
                    let CurrentSystemState: u32 = unsafe {
                        ::core::mem::transmute(CurrentSystemState)
                    };
                    CurrentSystemState as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                20usize,
                1u8,
                {
                    let IgnoreHibernationPath: u32 = unsafe {
                        ::core::mem::transmute(IgnoreHibernationPath)
                    };
                    IgnoreHibernationPath as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                21usize,
                1u8,
                {
                    let PseudoTransition: u32 = unsafe {
                        ::core::mem::transmute(PseudoTransition)
                    };
                    PseudoTransition as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                22usize,
                1u8,
                {
                    let KernelSoftReboot: u32 = unsafe {
                        ::core::mem::transmute(KernelSoftReboot)
                    };
                    KernelSoftReboot as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                23usize,
                1u8,
                {
                    let DirectedDripsTransition: u32 = unsafe {
                        ::core::mem::transmute(DirectedDripsTransition)
                    };
                    DirectedDripsTransition as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                24usize,
                8u8,
                {
                    let Reserved2: u32 = unsafe { ::core::mem::transmute(Reserved2) };
                    Reserved2 as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ContextAsUlong) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1),
            "::",
            stringify!(ContextAsUlong),
        ),
    );
}
impl Default for _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__SYSTEM_POWER_STATE_CONTEXT() {
    assert_eq!(
        ::core::mem::size_of::<_SYSTEM_POWER_STATE_CONTEXT>(),
        4usize,
        concat!("Size of: ", stringify!(_SYSTEM_POWER_STATE_CONTEXT)),
    );
    assert_eq!(
        ::core::mem::align_of::<_SYSTEM_POWER_STATE_CONTEXT>(),
        4usize,
        concat!("Alignment of ", stringify!(_SYSTEM_POWER_STATE_CONTEXT)),
    );
}
impl Default for _SYSTEM_POWER_STATE_CONTEXT {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type SYSTEM_POWER_STATE_CONTEXT = _SYSTEM_POWER_STATE_CONTEXT;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR {
    pub Type: UCHAR,
    pub ShareDisposition: UCHAR,
    pub Flags: USHORT,
    pub u: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1 {
    pub Generic: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1,
    pub Port: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2,
    pub Interrupt: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
    pub MessageInterrupt: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4,
    pub Memory: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5,
    pub Dma: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6,
    pub DmaV3: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7,
    pub DevicePrivate: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8,
    pub BusNumber: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9,
    pub DeviceSpecificData: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10,
    pub Memory40: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11,
    pub Memory48: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12,
    pub Memory64: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
    pub Connection: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14,
}
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1 {
    pub Start: PHYSICAL_ADDRESS,
    pub Length: ULONG,
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1,
        >(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(Start),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(Length),
        ),
    );
}
impl Default for _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2 {
    pub Start: PHYSICAL_ADDRESS,
    pub Length: ULONG,
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2,
        >(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(Start),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(Length),
        ),
    );
}
impl Default for _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3 {
    pub Level: ULONG,
    pub Vector: ULONG,
    pub Affinity: KAFFINITY,
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
        >(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Level) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(Level),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Vector) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(Vector),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Affinity) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(Affinity),
        ),
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4 {
    pub __bindgen_anon_1: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1 {
    pub Raw: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
    pub Translated: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1 {
    pub Reserved: USHORT,
    pub MessageCount: USHORT,
    pub Vector: ULONG,
    pub Affinity: KAFFINITY,
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        >(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1
            ),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1
            ),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1
            ),
            "::",
            stringify!(Reserved),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MessageCount) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1
            ),
            "::",
            stringify!(MessageCount),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Vector) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1
            ),
            "::",
            stringify!(Vector),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Affinity) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1
            ),
            "::",
            stringify!(Affinity),
        ),
    );
}
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2 {
    pub Level: ULONG,
    pub Vector: ULONG,
    pub Affinity: KAFFINITY,
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2,
        >(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2
            ),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2
            ),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Level) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2
            ),
            "::",
            stringify!(Level),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Vector) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2
            ),
            "::",
            stringify!(Vector),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Affinity) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2
            ),
            "::",
            stringify!(Affinity),
        ),
    );
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
        >(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1
            ),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1
            ),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Raw) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1
            ),
            "::",
            stringify!(Raw),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Translated) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(
                _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1
            ),
            "::",
            stringify!(Translated),
        ),
    );
}
impl Default
for _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4() {
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4,
        >(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4),
        ),
    );
}
impl Default for _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5 {
    pub Start: PHYSICAL_ADDRESS,
    pub Length: ULONG,
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5,
        >(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(Start),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(Length),
        ),
    );
}
impl Default for _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6 {
    pub Channel: ULONG,
    pub Port: ULONG,
    pub Reserved1: ULONG,
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6,
        >(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Channel) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(Channel),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Port) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(Port),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(Reserved1),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7 {
    pub Channel: ULONG,
    pub RequestLine: ULONG,
    pub TransferWidth: UCHAR,
    pub Reserved1: UCHAR,
    pub Reserved2: UCHAR,
    pub Reserved3: UCHAR,
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7,
        >(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Channel) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(Channel),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RequestLine) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(RequestLine),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TransferWidth) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(TransferWidth),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved1) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(Reserved1),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved2) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(Reserved2),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved3) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(Reserved3),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8 {
    pub Data: [ULONG; 3usize],
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8,
        >(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8),
            "::",
            stringify!(Data),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9 {
    pub Start: ULONG,
    pub Length: ULONG,
    pub Reserved: ULONG,
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9,
        >(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(Start),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(Length),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(Reserved),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10 {
    pub DataSize: ULONG,
    pub Reserved1: ULONG,
    pub Reserved2: ULONG,
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10,
        >(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DataSize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10),
            "::",
            stringify!(DataSize),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved1) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10),
            "::",
            stringify!(Reserved1),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10),
            "::",
            stringify!(Reserved2),
        ),
    );
}
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11 {
    pub Start: PHYSICAL_ADDRESS,
    pub Length40: ULONG,
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11,
        >(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(Start),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length40) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(Length40),
        ),
    );
}
impl Default for _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12 {
    pub Start: PHYSICAL_ADDRESS,
    pub Length48: ULONG,
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12,
        >(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(Start),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length48) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(Length48),
        ),
    );
}
impl Default for _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13 {
    pub Start: PHYSICAL_ADDRESS,
    pub Length64: ULONG,
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
        >(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13),
            "::",
            stringify!(Start),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length64) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13),
            "::",
            stringify!(Length64),
        ),
    );
}
impl Default for _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14 {
    pub Class: UCHAR,
    pub Type: UCHAR,
    pub Reserved1: UCHAR,
    pub Reserved2: UCHAR,
    pub IdLowPart: ULONG,
    pub IdHighPart: ULONG,
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14,
        >(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14,
        >(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Class) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14),
            "::",
            stringify!(Class),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14),
            "::",
            stringify!(Type),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved1) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14),
            "::",
            stringify!(Reserved1),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved2) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14),
            "::",
            stringify!(Reserved2),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IdLowPart) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14),
            "::",
            stringify!(IdLowPart),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IdHighPart) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14),
            "::",
            stringify!(IdHighPart),
        ),
    );
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Generic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Generic),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Port) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Port),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Interrupt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Interrupt),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MessageInterrupt) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(MessageInterrupt),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Memory) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Memory),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Dma) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Dma),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DmaV3) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(DmaV3),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DevicePrivate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(DevicePrivate),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BusNumber) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(BusNumber),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).DeviceSpecificData) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(DeviceSpecificData),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Memory40) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Memory40),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Memory48) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Memory48),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Memory64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Memory64),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Connection) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Connection),
        ),
    );
}
impl Default for _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_DESCRIPTOR() {
    const UNINIT: ::core::mem::MaybeUninit<_CM_PARTIAL_RESOURCE_DESCRIPTOR> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR>(),
        20usize,
        concat!("Size of: ", stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR)),
    );
    assert_eq!(
        ::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR>(),
        4usize,
        concat!("Alignment of ", stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR),
            "::",
            stringify!(Type),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ShareDisposition) as usize - ptr as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR),
            "::",
            stringify!(ShareDisposition),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR),
            "::",
            stringify!(Flags),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_DESCRIPTOR),
            "::",
            stringify!(u),
        ),
    );
}
impl Default for _CM_PARTIAL_RESOURCE_DESCRIPTOR {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type CM_PARTIAL_RESOURCE_DESCRIPTOR = _CM_PARTIAL_RESOURCE_DESCRIPTOR;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _CM_PARTIAL_RESOURCE_LIST {
    pub Version: USHORT,
    pub Revision: USHORT,
    pub Count: ULONG,
    pub PartialDescriptors: [CM_PARTIAL_RESOURCE_DESCRIPTOR; 1usize],
}
#[test]
fn bindgen_test_layout__CM_PARTIAL_RESOURCE_LIST() {
    const UNINIT: ::core::mem::MaybeUninit<_CM_PARTIAL_RESOURCE_LIST> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_CM_PARTIAL_RESOURCE_LIST>(),
        28usize,
        concat!("Size of: ", stringify!(_CM_PARTIAL_RESOURCE_LIST)),
    );
    assert_eq!(
        ::core::mem::align_of::<_CM_PARTIAL_RESOURCE_LIST>(),
        4usize,
        concat!("Alignment of ", stringify!(_CM_PARTIAL_RESOURCE_LIST)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_LIST),
            "::",
            stringify!(Version),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Revision) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_LIST),
            "::",
            stringify!(Revision),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_LIST),
            "::",
            stringify!(Count),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PartialDescriptors) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_PARTIAL_RESOURCE_LIST),
            "::",
            stringify!(PartialDescriptors),
        ),
    );
}
impl Default for _CM_PARTIAL_RESOURCE_LIST {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type CM_PARTIAL_RESOURCE_LIST = _CM_PARTIAL_RESOURCE_LIST;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _CM_FULL_RESOURCE_DESCRIPTOR {
    pub InterfaceType: INTERFACE_TYPE,
    pub BusNumber: ULONG,
    pub PartialResourceList: CM_PARTIAL_RESOURCE_LIST,
}
#[test]
fn bindgen_test_layout__CM_FULL_RESOURCE_DESCRIPTOR() {
    const UNINIT: ::core::mem::MaybeUninit<_CM_FULL_RESOURCE_DESCRIPTOR> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_CM_FULL_RESOURCE_DESCRIPTOR>(),
        36usize,
        concat!("Size of: ", stringify!(_CM_FULL_RESOURCE_DESCRIPTOR)),
    );
    assert_eq!(
        ::core::mem::align_of::<_CM_FULL_RESOURCE_DESCRIPTOR>(),
        4usize,
        concat!("Alignment of ", stringify!(_CM_FULL_RESOURCE_DESCRIPTOR)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).InterfaceType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_FULL_RESOURCE_DESCRIPTOR),
            "::",
            stringify!(InterfaceType),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BusNumber) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_FULL_RESOURCE_DESCRIPTOR),
            "::",
            stringify!(BusNumber),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PartialResourceList) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_FULL_RESOURCE_DESCRIPTOR),
            "::",
            stringify!(PartialResourceList),
        ),
    );
}
impl Default for _CM_FULL_RESOURCE_DESCRIPTOR {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type CM_FULL_RESOURCE_DESCRIPTOR = _CM_FULL_RESOURCE_DESCRIPTOR;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _CM_RESOURCE_LIST {
    pub Count: ULONG,
    pub List: [CM_FULL_RESOURCE_DESCRIPTOR; 1usize],
}
#[test]
fn bindgen_test_layout__CM_RESOURCE_LIST() {
    const UNINIT: ::core::mem::MaybeUninit<_CM_RESOURCE_LIST> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_CM_RESOURCE_LIST>(),
        40usize,
        concat!("Size of: ", stringify!(_CM_RESOURCE_LIST)),
    );
    assert_eq!(
        ::core::mem::align_of::<_CM_RESOURCE_LIST>(),
        4usize,
        concat!("Alignment of ", stringify!(_CM_RESOURCE_LIST)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_RESOURCE_LIST),
            "::",
            stringify!(Count),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).List) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_CM_RESOURCE_LIST),
            "::",
            stringify!(List),
        ),
    );
}
impl Default for _CM_RESOURCE_LIST {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type PCM_RESOURCE_LIST = *mut _CM_RESOURCE_LIST;
pub mod _IRQ_DEVICE_POLICY {
    pub type Type = ::core::ffi::c_int;
    pub const IrqPolicyMachineDefault: Type = 0;
    pub const IrqPolicyAllCloseProcessors: Type = 1;
    pub const IrqPolicyOneCloseProcessor: Type = 2;
    pub const IrqPolicyAllProcessorsInMachine: Type = 3;
    pub const IrqPolicySpecifiedProcessors: Type = 4;
    pub const IrqPolicySpreadMessagesAcrossAllProcessors: Type = 5;
    pub const IrqPolicyAllProcessorsInMachineWhenSteered: Type = 6;
}
pub use self::_IRQ_DEVICE_POLICY::Type as IRQ_DEVICE_POLICY;
pub mod _IRQ_PRIORITY {
    pub type Type = ::core::ffi::c_int;
    pub const IrqPriorityUndefined: Type = 0;
    pub const IrqPriorityLow: Type = 1;
    pub const IrqPriorityNormal: Type = 2;
    pub const IrqPriorityHigh: Type = 3;
}
pub use self::_IRQ_PRIORITY::Type as IRQ_PRIORITY;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_RESOURCE_DESCRIPTOR {
    pub Option: UCHAR,
    pub Type: UCHAR,
    pub ShareDisposition: UCHAR,
    pub Spare1: UCHAR,
    pub Flags: USHORT,
    pub Spare2: USHORT,
    pub u: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1 {
    pub Port: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1,
    pub Memory: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2,
    pub Interrupt: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
    pub Dma: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4,
    pub DmaV3: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5,
    pub Generic: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6,
    pub DevicePrivate: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7,
    pub BusNumber: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8,
    pub ConfigData: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9,
    pub Memory40: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10,
    pub Memory48: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11,
    pub Memory64: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12,
    pub Connection: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1 {
    pub Length: ULONG,
    pub Alignment: ULONG,
    pub MinimumAddress: PHYSICAL_ADDRESS,
    pub MaximumAddress: PHYSICAL_ADDRESS,
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(Length),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Alignment) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(Alignment),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MinimumAddress) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(MinimumAddress),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MaximumAddress) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(MaximumAddress),
        ),
    );
}
impl Default for _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2 {
    pub Length: ULONG,
    pub Alignment: ULONG,
    pub MinimumAddress: PHYSICAL_ADDRESS,
    pub MaximumAddress: PHYSICAL_ADDRESS,
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(Length),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Alignment) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(Alignment),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MinimumAddress) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(MinimumAddress),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MaximumAddress) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(MaximumAddress),
        ),
    );
}
impl Default for _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3 {
    pub MinimumVector: ULONG,
    pub MaximumVector: ULONG,
    pub AffinityPolicy: IRQ_DEVICE_POLICY,
    pub PriorityPolicy: IRQ_PRIORITY,
    pub TargetedProcessors: KAFFINITY,
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::core::mem::MaybeUninit<
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MinimumVector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(MinimumVector),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MaximumVector) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(MaximumVector),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AffinityPolicy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(AffinityPolicy),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PriorityPolicy) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(PriorityPolicy),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TargetedProcessors) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(TargetedProcessors),
        ),
    );
}
impl Default for _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4 {
    pub MinimumChannel: ULONG,
    pub MaximumChannel: ULONG,
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4() {
    const UNINIT: ::core::mem::MaybeUninit<
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MinimumChannel) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(MinimumChannel),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MaximumChannel) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(MaximumChannel),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5 {
    pub RequestLine: ULONG,
    pub Reserved: ULONG,
    pub Channel: ULONG,
    pub TransferWidth: ULONG,
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5() {
    const UNINIT: ::core::mem::MaybeUninit<
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RequestLine) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(RequestLine),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(Reserved),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Channel) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(Channel),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TransferWidth) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(TransferWidth),
        ),
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6 {
    pub Length: ULONG,
    pub Alignment: ULONG,
    pub MinimumAddress: PHYSICAL_ADDRESS,
    pub MaximumAddress: PHYSICAL_ADDRESS,
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6() {
    const UNINIT: ::core::mem::MaybeUninit<
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(Length),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Alignment) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(Alignment),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MinimumAddress) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(MinimumAddress),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MaximumAddress) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(MaximumAddress),
        ),
    );
}
impl Default for _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7 {
    pub Data: [ULONG; 3usize],
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7() {
    const UNINIT: ::core::mem::MaybeUninit<
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(Data),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8 {
    pub Length: ULONG,
    pub MinBusNumber: ULONG,
    pub MaxBusNumber: ULONG,
    pub Reserved: ULONG,
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8() {
    const UNINIT: ::core::mem::MaybeUninit<
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8),
            "::",
            stringify!(Length),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MinBusNumber) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8),
            "::",
            stringify!(MinBusNumber),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MaxBusNumber) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8),
            "::",
            stringify!(MaxBusNumber),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8),
            "::",
            stringify!(Reserved),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9 {
    pub Priority: ULONG,
    pub Reserved1: ULONG,
    pub Reserved2: ULONG,
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9() {
    const UNINIT: ::core::mem::MaybeUninit<
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Priority) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(Priority),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved1) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(Reserved1),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(Reserved2),
        ),
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10 {
    pub Length40: ULONG,
    pub Alignment40: ULONG,
    pub MinimumAddress: PHYSICAL_ADDRESS,
    pub MaximumAddress: PHYSICAL_ADDRESS,
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10() {
    const UNINIT: ::core::mem::MaybeUninit<
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length40) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10),
            "::",
            stringify!(Length40),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Alignment40) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10),
            "::",
            stringify!(Alignment40),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MinimumAddress) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10),
            "::",
            stringify!(MinimumAddress),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MaximumAddress) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10),
            "::",
            stringify!(MaximumAddress),
        ),
    );
}
impl Default for _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11 {
    pub Length48: ULONG,
    pub Alignment48: ULONG,
    pub MinimumAddress: PHYSICAL_ADDRESS,
    pub MaximumAddress: PHYSICAL_ADDRESS,
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11() {
    const UNINIT: ::core::mem::MaybeUninit<
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length48) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(Length48),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Alignment48) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(Alignment48),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MinimumAddress) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(MinimumAddress),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MaximumAddress) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(MaximumAddress),
        ),
    );
}
impl Default for _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12 {
    pub Length64: ULONG,
    pub Alignment64: ULONG,
    pub MinimumAddress: PHYSICAL_ADDRESS,
    pub MaximumAddress: PHYSICAL_ADDRESS,
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12() {
    const UNINIT: ::core::mem::MaybeUninit<
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Length64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(Length64),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Alignment64) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(Alignment64),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MinimumAddress) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(MinimumAddress),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MaximumAddress) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(MaximumAddress),
        ),
    );
}
impl Default for _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13 {
    pub Class: UCHAR,
    pub Type: UCHAR,
    pub Reserved1: UCHAR,
    pub Reserved2: UCHAR,
    pub IdLowPart: ULONG,
    pub IdHighPart: ULONG,
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13() {
    const UNINIT: ::core::mem::MaybeUninit<
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Class) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13),
            "::",
            stringify!(Class),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13),
            "::",
            stringify!(Type),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved1) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13),
            "::",
            stringify!(Reserved1),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved2) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13),
            "::",
            stringify!(Reserved2),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IdLowPart) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13),
            "::",
            stringify!(IdLowPart),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).IdHighPart) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13),
            "::",
            stringify!(IdHighPart),
        ),
    );
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Port) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Port),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Memory) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Memory),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Interrupt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Interrupt),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Dma) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Dma),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DmaV3) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(DmaV3),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Generic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Generic),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DevicePrivate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(DevicePrivate),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BusNumber) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(BusNumber),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ConfigData) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(ConfigData),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Memory40) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Memory40),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Memory48) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Memory48),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Memory64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Memory64),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Connection) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1),
            "::",
            stringify!(Connection),
        ),
    );
}
impl Default for _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_DESCRIPTOR() {
    const UNINIT: ::core::mem::MaybeUninit<_IO_RESOURCE_DESCRIPTOR> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR>(),
        32usize,
        concat!("Size of: ", stringify!(_IO_RESOURCE_DESCRIPTOR)),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_RESOURCE_DESCRIPTOR)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Option) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR),
            "::",
            stringify!(Option),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR),
            "::",
            stringify!(Type),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ShareDisposition) as usize - ptr as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR),
            "::",
            stringify!(ShareDisposition),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Spare1) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR),
            "::",
            stringify!(Spare1),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR),
            "::",
            stringify!(Flags),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Spare2) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR),
            "::",
            stringify!(Spare2),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_DESCRIPTOR),
            "::",
            stringify!(u),
        ),
    );
}
impl Default for _IO_RESOURCE_DESCRIPTOR {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type IO_RESOURCE_DESCRIPTOR = _IO_RESOURCE_DESCRIPTOR;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_RESOURCE_LIST {
    pub Version: USHORT,
    pub Revision: USHORT,
    pub Count: ULONG,
    pub Descriptors: [IO_RESOURCE_DESCRIPTOR; 1usize],
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_LIST() {
    const UNINIT: ::core::mem::MaybeUninit<_IO_RESOURCE_LIST> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_LIST>(),
        40usize,
        concat!("Size of: ", stringify!(_IO_RESOURCE_LIST)),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_LIST>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_RESOURCE_LIST)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_LIST),
            "::",
            stringify!(Version),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Revision) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_LIST),
            "::",
            stringify!(Revision),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_LIST),
            "::",
            stringify!(Count),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Descriptors) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_LIST),
            "::",
            stringify!(Descriptors),
        ),
    );
}
impl Default for _IO_RESOURCE_LIST {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type IO_RESOURCE_LIST = _IO_RESOURCE_LIST;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_RESOURCE_REQUIREMENTS_LIST {
    pub ListSize: ULONG,
    pub InterfaceType: INTERFACE_TYPE,
    pub BusNumber: ULONG,
    pub SlotNumber: ULONG,
    pub Reserved: [ULONG; 3usize],
    pub AlternativeLists: ULONG,
    pub List: [IO_RESOURCE_LIST; 1usize],
}
#[test]
fn bindgen_test_layout__IO_RESOURCE_REQUIREMENTS_LIST() {
    const UNINIT: ::core::mem::MaybeUninit<_IO_RESOURCE_REQUIREMENTS_LIST> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_RESOURCE_REQUIREMENTS_LIST>(),
        72usize,
        concat!("Size of: ", stringify!(_IO_RESOURCE_REQUIREMENTS_LIST)),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_RESOURCE_REQUIREMENTS_LIST>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_RESOURCE_REQUIREMENTS_LIST)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ListSize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_REQUIREMENTS_LIST),
            "::",
            stringify!(ListSize),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).InterfaceType) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_REQUIREMENTS_LIST),
            "::",
            stringify!(InterfaceType),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BusNumber) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_REQUIREMENTS_LIST),
            "::",
            stringify!(BusNumber),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SlotNumber) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_REQUIREMENTS_LIST),
            "::",
            stringify!(SlotNumber),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_REQUIREMENTS_LIST),
            "::",
            stringify!(Reserved),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AlternativeLists) as usize - ptr as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_REQUIREMENTS_LIST),
            "::",
            stringify!(AlternativeLists),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).List) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_RESOURCE_REQUIREMENTS_LIST),
            "::",
            stringify!(List),
        ),
    );
}
impl Default for _IO_RESOURCE_REQUIREMENTS_LIST {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type PIO_RESOURCE_REQUIREMENTS_LIST = *mut _IO_RESOURCE_REQUIREMENTS_LIST;
pub type NOTIFICATION_MASK = ULONG;
pub use self::_POOL_TYPE::Type as POOL_TYPE;
pub type KPROCESSOR_MODE = CCHAR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _KAPC {
    pub Type: UCHAR,
    pub AllFlags: UCHAR,
    pub Size: UCHAR,
    pub SpareByte1: UCHAR,
    pub SpareLong0: ULONG,
    pub Thread: *mut _KTHREAD,
    pub ApcListEntry: LIST_ENTRY,
    pub Reserved: [PVOID; 3usize],
    pub NormalContext: PVOID,
    pub SystemArgument1: PVOID,
    pub SystemArgument2: PVOID,
    pub ApcStateIndex: CCHAR,
    pub ApcMode: KPROCESSOR_MODE,
    pub Inserted: BOOLEAN,
}
#[test]
fn bindgen_test_layout__KAPC() {
    const UNINIT: ::core::mem::MaybeUninit<_KAPC> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_KAPC>(),
        88usize,
        concat!("Size of: ", stringify!(_KAPC)),
    );
    assert_eq!(
        ::core::mem::align_of::<_KAPC>(),
        8usize,
        concat!("Alignment of ", stringify!(_KAPC)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_KAPC), "::", stringify!(Type)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AllFlags) as usize - ptr as usize },
        1usize,
        concat!("Offset of field: ", stringify!(_KAPC), "::", stringify!(AllFlags)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(_KAPC), "::", stringify!(Size)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SpareByte1) as usize - ptr as usize },
        3usize,
        concat!("Offset of field: ", stringify!(_KAPC), "::", stringify!(SpareByte1)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SpareLong0) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(_KAPC), "::", stringify!(SpareLong0)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Thread) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(_KAPC), "::", stringify!(Thread)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ApcListEntry) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(_KAPC), "::", stringify!(ApcListEntry)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(_KAPC), "::", stringify!(Reserved)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).NormalContext) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(_KAPC), "::", stringify!(NormalContext)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SystemArgument1) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_KAPC),
            "::",
            stringify!(SystemArgument1),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SystemArgument2) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_KAPC),
            "::",
            stringify!(SystemArgument2),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ApcStateIndex) as usize - ptr as usize },
        80usize,
        concat!("Offset of field: ", stringify!(_KAPC), "::", stringify!(ApcStateIndex)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ApcMode) as usize - ptr as usize },
        81usize,
        concat!("Offset of field: ", stringify!(_KAPC), "::", stringify!(ApcMode)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Inserted) as usize - ptr as usize },
        82usize,
        concat!("Offset of field: ", stringify!(_KAPC), "::", stringify!(Inserted)),
    );
}
impl Default for _KAPC {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type KAPC = _KAPC;
pub type KDEFERRED_ROUTINE = ::core::option::Option<
    unsafe extern "C" fn(
        Dpc: *mut _KDPC,
        DeferredContext: PVOID,
        SystemArgument1: PVOID,
        SystemArgument2: PVOID,
    ),
>;
pub type PKDEFERRED_ROUTINE = KDEFERRED_ROUTINE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _KDPC {
    pub __bindgen_anon_1: _KDPC__bindgen_ty_1,
    pub DpcListEntry: SINGLE_LIST_ENTRY,
    pub ProcessorHistory: KAFFINITY,
    pub DeferredRoutine: PKDEFERRED_ROUTINE,
    pub DeferredContext: PVOID,
    pub SystemArgument1: PVOID,
    pub SystemArgument2: PVOID,
    pub DpcData: PVOID,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _KDPC__bindgen_ty_1 {
    pub TargetInfoAsUlong: ULONG,
    pub __bindgen_anon_1: _KDPC__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _KDPC__bindgen_ty_1__bindgen_ty_1 {
    pub Type: UCHAR,
    pub Importance: UCHAR,
    pub Number: USHORT,
}
#[test]
fn bindgen_test_layout__KDPC__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_KDPC__bindgen_ty_1__bindgen_ty_1> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_KDPC__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_KDPC__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_KDPC__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(_KDPC__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_KDPC__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(Type),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Importance) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_KDPC__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(Importance),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Number) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_KDPC__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(Number),
        ),
    );
}
#[test]
fn bindgen_test_layout__KDPC__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_KDPC__bindgen_ty_1> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_KDPC__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_KDPC__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_KDPC__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_KDPC__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TargetInfoAsUlong) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_KDPC__bindgen_ty_1),
            "::",
            stringify!(TargetInfoAsUlong),
        ),
    );
}
impl Default for _KDPC__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__KDPC() {
    const UNINIT: ::core::mem::MaybeUninit<_KDPC> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_KDPC>(),
        64usize,
        concat!("Size of: ", stringify!(_KDPC)),
    );
    assert_eq!(
        ::core::mem::align_of::<_KDPC>(),
        8usize,
        concat!("Alignment of ", stringify!(_KDPC)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DpcListEntry) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(_KDPC), "::", stringify!(DpcListEntry)),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ProcessorHistory) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_KDPC),
            "::",
            stringify!(ProcessorHistory),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DeferredRoutine) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_KDPC),
            "::",
            stringify!(DeferredRoutine),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DeferredContext) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_KDPC),
            "::",
            stringify!(DeferredContext),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SystemArgument1) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_KDPC),
            "::",
            stringify!(SystemArgument1),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SystemArgument2) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_KDPC),
            "::",
            stringify!(SystemArgument2),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DpcData) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(_KDPC), "::", stringify!(DpcData)),
    );
}
impl Default for _KDPC {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type KDPC = _KDPC;
pub type PKDPC = *mut _KDPC;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _MDL {
    pub Next: *mut _MDL,
    pub Size: CSHORT,
    pub MdlFlags: CSHORT,
    pub Process: *mut _EPROCESS,
    pub MappedSystemVa: PVOID,
    pub StartVa: PVOID,
    pub ByteCount: ULONG,
    pub ByteOffset: ULONG,
}
#[test]
fn bindgen_test_layout__MDL() {
    const UNINIT: ::core::mem::MaybeUninit<_MDL> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_MDL>(),
        48usize,
        concat!("Size of: ", stringify!(_MDL)),
    );
    assert_eq!(
        ::core::mem::align_of::<_MDL>(),
        8usize,
        concat!("Alignment of ", stringify!(_MDL)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Next) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_MDL), "::", stringify!(Next)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(_MDL), "::", stringify!(Size)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MdlFlags) as usize - ptr as usize },
        10usize,
        concat!("Offset of field: ", stringify!(_MDL), "::", stringify!(MdlFlags)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Process) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(_MDL), "::", stringify!(Process)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MappedSystemVa) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(_MDL), "::", stringify!(MappedSystemVa)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).StartVa) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(_MDL), "::", stringify!(StartVa)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ByteCount) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(_MDL), "::", stringify!(ByteCount)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ByteOffset) as usize - ptr as usize },
        44usize,
        concat!("Offset of field: ", stringify!(_MDL), "::", stringify!(ByteOffset)),
    );
}
impl Default for _MDL {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type PMDL = *mut _MDL;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _DISPATCHER_HEADER {
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1,
    pub SignalState: LONG,
    pub WaitListHead: LIST_ENTRY,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1 {
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2,
    pub __bindgen_anon_3: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3,
    pub __bindgen_anon_4: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4,
    pub __bindgen_anon_5: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5,
    pub __bindgen_anon_6: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6,
    pub __bindgen_anon_7: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1 {
    pub Lock: LONG,
    pub LockNV: LONG,
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(Lock),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LockNV) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(LockNV),
        ),
    );
}
impl Default for _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2 {
    pub Type: UCHAR,
    pub Signalling: UCHAR,
    pub Size: UCHAR,
    pub Reserved1: UCHAR,
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2)),
    );
    assert_eq!(
        ::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(Type),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Signalling) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(Signalling),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(Size),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved1) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(Reserved1),
        ),
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3 {
    pub TimerType: UCHAR,
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1,
    pub Hand: UCHAR,
    pub __bindgen_anon_2: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1 {
    pub TimerControlFlags: UCHAR,
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(
                _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1
            ),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(
                _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1
            ),
        ),
    );
}
impl _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn Absolute(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Absolute(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Wake(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Wake(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn EncodedTolerableDelay(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_EncodedTolerableDelay(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        Absolute: UCHAR,
        Wake: UCHAR,
        EncodedTolerableDelay: UCHAR,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                1u8,
                {
                    let Absolute: u8 = unsafe { ::core::mem::transmute(Absolute) };
                    Absolute as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                1usize,
                1u8,
                {
                    let Wake: u8 = unsafe { ::core::mem::transmute(Wake) };
                    Wake as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                2usize,
                6u8,
                {
                    let EncodedTolerableDelay: u8 = unsafe {
                        ::core::mem::transmute(EncodedTolerableDelay)
                    };
                    EncodedTolerableDelay as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TimerControlFlags) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1),
            "::",
            stringify!(TimerControlFlags),
        ),
    );
}
impl Default for _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2 {
    pub TimerMiscFlags: UCHAR,
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(
                _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1
            ),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(
                _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1
            ),
        ),
    );
}
impl _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1 {
    #[inline]
    pub fn Index(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_Index(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn Inserted(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Inserted(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Expired(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Expired(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        Index: UCHAR,
        Inserted: UCHAR,
        Expired: UCHAR,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                6u8,
                {
                    let Index: u8 = unsafe { ::core::mem::transmute(Index) };
                    Index as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                6usize,
                1u8,
                {
                    let Inserted: u8 = unsafe { ::core::mem::transmute(Inserted) };
                    Inserted as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                7usize,
                1u8,
                {
                    let Expired: u8 = unsafe { ::core::mem::transmute(Expired) };
                    Expired as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2,
        >(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2,
        >(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TimerMiscFlags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2),
            "::",
            stringify!(TimerMiscFlags),
        ),
    );
}
impl Default for _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::core::mem::MaybeUninit<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3>(),
        4usize,
        concat!("Size of: ", stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3)),
    );
    assert_eq!(
        ::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TimerType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(TimerType),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Hand) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(Hand),
        ),
    );
}
impl Default for _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4 {
    pub Timer2Type: UCHAR,
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
    pub Timer2ComponentId: UCHAR,
    pub Timer2RelativeId: UCHAR,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1 {
    pub Timer2Flags: UCHAR,
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(
                _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1
            ),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(
                _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1
            ),
        ),
    );
}
impl _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn Timer2Inserted(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Timer2Inserted(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Timer2Expiring(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Timer2Expiring(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Timer2CancelPending(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Timer2CancelPending(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Timer2SetPending(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Timer2SetPending(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Timer2Running(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Timer2Running(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Timer2Disabled(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Timer2Disabled(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Timer2ReservedFlags(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_Timer2ReservedFlags(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        Timer2Inserted: UCHAR,
        Timer2Expiring: UCHAR,
        Timer2CancelPending: UCHAR,
        Timer2SetPending: UCHAR,
        Timer2Running: UCHAR,
        Timer2Disabled: UCHAR,
        Timer2ReservedFlags: UCHAR,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                1u8,
                {
                    let Timer2Inserted: u8 = unsafe {
                        ::core::mem::transmute(Timer2Inserted)
                    };
                    Timer2Inserted as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                1usize,
                1u8,
                {
                    let Timer2Expiring: u8 = unsafe {
                        ::core::mem::transmute(Timer2Expiring)
                    };
                    Timer2Expiring as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                2usize,
                1u8,
                {
                    let Timer2CancelPending: u8 = unsafe {
                        ::core::mem::transmute(Timer2CancelPending)
                    };
                    Timer2CancelPending as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                3usize,
                1u8,
                {
                    let Timer2SetPending: u8 = unsafe {
                        ::core::mem::transmute(Timer2SetPending)
                    };
                    Timer2SetPending as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                4usize,
                1u8,
                {
                    let Timer2Running: u8 = unsafe {
                        ::core::mem::transmute(Timer2Running)
                    };
                    Timer2Running as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                5usize,
                1u8,
                {
                    let Timer2Disabled: u8 = unsafe {
                        ::core::mem::transmute(Timer2Disabled)
                    };
                    Timer2Disabled as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                6usize,
                2u8,
                {
                    let Timer2ReservedFlags: u8 = unsafe {
                        ::core::mem::transmute(Timer2ReservedFlags)
                    };
                    Timer2ReservedFlags as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Timer2Flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1),
            "::",
            stringify!(Timer2Flags),
        ),
    );
}
impl Default for _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4() {
    const UNINIT: ::core::mem::MaybeUninit<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4>(),
        4usize,
        concat!("Size of: ", stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4)),
    );
    assert_eq!(
        ::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Timer2Type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(Timer2Type),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Timer2ComponentId) as usize - ptr as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(Timer2ComponentId),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Timer2RelativeId) as usize - ptr as usize
        },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(Timer2RelativeId),
        ),
    );
}
impl Default for _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5 {
    pub QueueType: UCHAR,
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
    pub QueueSize: UCHAR,
    pub QueueReserved: UCHAR,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 {
    pub QueueControlFlags: UCHAR,
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(
                _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1
            ),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(
                _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1
            ),
        ),
    );
}
impl _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn Abandoned(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Abandoned(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn DisableIncrement(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_DisableIncrement(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn QueueReservedControlFlags(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_QueueReservedControlFlags(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        Abandoned: UCHAR,
        DisableIncrement: UCHAR,
        QueueReservedControlFlags: UCHAR,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                1u8,
                {
                    let Abandoned: u8 = unsafe { ::core::mem::transmute(Abandoned) };
                    Abandoned as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                1usize,
                1u8,
                {
                    let DisableIncrement: u8 = unsafe {
                        ::core::mem::transmute(DisableIncrement)
                    };
                    DisableIncrement as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                2usize,
                6u8,
                {
                    let QueueReservedControlFlags: u8 = unsafe {
                        ::core::mem::transmute(QueueReservedControlFlags)
                    };
                    QueueReservedControlFlags as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).QueueControlFlags) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1),
            "::",
            stringify!(QueueControlFlags),
        ),
    );
}
impl Default for _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5() {
    const UNINIT: ::core::mem::MaybeUninit<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5>(),
        4usize,
        concat!("Size of: ", stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5)),
    );
    assert_eq!(
        ::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).QueueType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(QueueType),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).QueueSize) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(QueueSize),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).QueueReserved) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(QueueReserved),
        ),
    );
}
impl Default for _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6 {
    pub ThreadType: UCHAR,
    pub ThreadReserved: UCHAR,
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1,
    pub __bindgen_anon_2: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1 {
    pub ThreadControlFlags: UCHAR,
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(
                _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1
            ),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(
                _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1
            ),
        ),
    );
}
impl _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn CycleProfiling(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_CycleProfiling(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn CounterProfiling(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_CounterProfiling(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn GroupScheduling(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_GroupScheduling(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn AffinitySet(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_AffinitySet(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Tagged(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Tagged(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn EnergyProfiling(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_EnergyProfiling(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SchedulerAssist(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SchedulerAssist(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ThreadReservedControlFlags(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ThreadReservedControlFlags(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        CycleProfiling: UCHAR,
        CounterProfiling: UCHAR,
        GroupScheduling: UCHAR,
        AffinitySet: UCHAR,
        Tagged: UCHAR,
        EnergyProfiling: UCHAR,
        SchedulerAssist: UCHAR,
        ThreadReservedControlFlags: UCHAR,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                1u8,
                {
                    let CycleProfiling: u8 = unsafe {
                        ::core::mem::transmute(CycleProfiling)
                    };
                    CycleProfiling as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                1usize,
                1u8,
                {
                    let CounterProfiling: u8 = unsafe {
                        ::core::mem::transmute(CounterProfiling)
                    };
                    CounterProfiling as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                2usize,
                1u8,
                {
                    let GroupScheduling: u8 = unsafe {
                        ::core::mem::transmute(GroupScheduling)
                    };
                    GroupScheduling as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                3usize,
                1u8,
                {
                    let AffinitySet: u8 = unsafe { ::core::mem::transmute(AffinitySet) };
                    AffinitySet as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                4usize,
                1u8,
                {
                    let Tagged: u8 = unsafe { ::core::mem::transmute(Tagged) };
                    Tagged as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                5usize,
                1u8,
                {
                    let EnergyProfiling: u8 = unsafe {
                        ::core::mem::transmute(EnergyProfiling)
                    };
                    EnergyProfiling as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                6usize,
                1u8,
                {
                    let SchedulerAssist: u8 = unsafe {
                        ::core::mem::transmute(SchedulerAssist)
                    };
                    SchedulerAssist as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                7usize,
                1u8,
                {
                    let ThreadReservedControlFlags: u8 = unsafe {
                        ::core::mem::transmute(ThreadReservedControlFlags)
                    };
                    ThreadReservedControlFlags as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ThreadControlFlags) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1),
            "::",
            stringify!(ThreadControlFlags),
        ),
    );
}
impl Default for _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2 {
    pub DebugActive: UCHAR,
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(
                _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1
            ),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1,
        >(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(
                _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1
            ),
        ),
    );
}
impl _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1 {
    #[inline]
    pub fn ActiveDR7(&self) -> BOOLEAN {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ActiveDR7(&mut self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Instrumented(&self) -> BOOLEAN {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Instrumented(&mut self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Minimal(&self) -> BOOLEAN {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Minimal(&mut self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Reserved4(&self) -> BOOLEAN {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_Reserved4(&mut self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn AltSyscall(&self) -> BOOLEAN {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_AltSyscall(&mut self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Emulation(&self) -> BOOLEAN {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Emulation(&mut self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Reserved5(&self) -> BOOLEAN {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Reserved5(&mut self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ActiveDR7: BOOLEAN,
        Instrumented: BOOLEAN,
        Minimal: BOOLEAN,
        Reserved4: BOOLEAN,
        AltSyscall: BOOLEAN,
        Emulation: BOOLEAN,
        Reserved5: BOOLEAN,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                1u8,
                {
                    let ActiveDR7: u8 = unsafe { ::core::mem::transmute(ActiveDR7) };
                    ActiveDR7 as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                1usize,
                1u8,
                {
                    let Instrumented: u8 = unsafe {
                        ::core::mem::transmute(Instrumented)
                    };
                    Instrumented as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                2usize,
                1u8,
                {
                    let Minimal: u8 = unsafe { ::core::mem::transmute(Minimal) };
                    Minimal as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                3usize,
                2u8,
                {
                    let Reserved4: u8 = unsafe { ::core::mem::transmute(Reserved4) };
                    Reserved4 as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                5usize,
                1u8,
                {
                    let AltSyscall: u8 = unsafe { ::core::mem::transmute(AltSyscall) };
                    AltSyscall as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                6usize,
                1u8,
                {
                    let Emulation: u8 = unsafe { ::core::mem::transmute(Emulation) };
                    Emulation as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                7usize,
                1u8,
                {
                    let Reserved5: u8 = unsafe { ::core::mem::transmute(Reserved5) };
                    Reserved5 as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2,
        >(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2),
        ),
    );
    assert_eq!(
        ::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2,
        >(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DebugActive) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2),
            "::",
            stringify!(DebugActive),
        ),
    );
}
impl Default for _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6() {
    const UNINIT: ::core::mem::MaybeUninit<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6>(),
        4usize,
        concat!("Size of: ", stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6)),
    );
    assert_eq!(
        ::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ThreadType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(ThreadType),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ThreadReserved) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(ThreadReserved),
        ),
    );
}
impl Default for _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7 {
    pub MutantType: UCHAR,
    pub MutantSize: UCHAR,
    pub DpcActive: BOOLEAN,
    pub MutantReserved: UCHAR,
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7() {
    const UNINIT: ::core::mem::MaybeUninit<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7>(),
        4usize,
        concat!("Size of: ", stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7)),
    );
    assert_eq!(
        ::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MutantType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(MutantType),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MutantSize) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(MutantSize),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DpcActive) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(DpcActive),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MutantReserved) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(MutantReserved),
        ),
    );
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_DISPATCHER_HEADER__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_DISPATCHER_HEADER__bindgen_ty_1)),
    );
}
impl Default for _DISPATCHER_HEADER__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__DISPATCHER_HEADER() {
    const UNINIT: ::core::mem::MaybeUninit<_DISPATCHER_HEADER> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_DISPATCHER_HEADER>(),
        24usize,
        concat!("Size of: ", stringify!(_DISPATCHER_HEADER)),
    );
    assert_eq!(
        ::core::mem::align_of::<_DISPATCHER_HEADER>(),
        8usize,
        concat!("Alignment of ", stringify!(_DISPATCHER_HEADER)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SignalState) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER),
            "::",
            stringify!(SignalState),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WaitListHead) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_DISPATCHER_HEADER),
            "::",
            stringify!(WaitListHead),
        ),
    );
}
impl Default for _DISPATCHER_HEADER {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type DISPATCHER_HEADER = _DISPATCHER_HEADER;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _KEVENT {
    pub Header: DISPATCHER_HEADER,
}
#[test]
fn bindgen_test_layout__KEVENT() {
    const UNINIT: ::core::mem::MaybeUninit<_KEVENT> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_KEVENT>(),
        24usize,
        concat!("Size of: ", stringify!(_KEVENT)),
    );
    assert_eq!(
        ::core::mem::align_of::<_KEVENT>(),
        8usize,
        concat!("Alignment of ", stringify!(_KEVENT)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_KEVENT), "::", stringify!(Header)),
    );
}
impl Default for _KEVENT {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type KEVENT = _KEVENT;
pub type PKEVENT = *mut _KEVENT;
pub mod _LOCK_OPERATION {
    pub type Type = ::core::ffi::c_int;
    pub const IoReadAccess: Type = 0;
    pub const IoWriteAccess: Type = 1;
    pub const IoModifyAccess: Type = 2;
}
pub use self::_LOCK_OPERATION::Type as LOCK_OPERATION;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _KWAIT_BLOCK {
    pub WaitListEntry: LIST_ENTRY,
    pub WaitType: UCHAR,
    pub BlockState: UCHAR,
    pub WaitKey: USHORT,
    pub SpareLong: LONG,
    pub __bindgen_anon_1: _KWAIT_BLOCK__bindgen_ty_1,
    pub Object: PVOID,
    pub SparePtr: PVOID,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _KWAIT_BLOCK__bindgen_ty_1 {
    pub Thread: *mut _KTHREAD,
    pub NotificationQueue: *mut _KQUEUE,
    pub Dpc: *mut _KDPC,
}
#[test]
fn bindgen_test_layout__KWAIT_BLOCK__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_KWAIT_BLOCK__bindgen_ty_1> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_KWAIT_BLOCK__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_KWAIT_BLOCK__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_KWAIT_BLOCK__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_KWAIT_BLOCK__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Thread) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_KWAIT_BLOCK__bindgen_ty_1),
            "::",
            stringify!(Thread),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).NotificationQueue) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_KWAIT_BLOCK__bindgen_ty_1),
            "::",
            stringify!(NotificationQueue),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Dpc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_KWAIT_BLOCK__bindgen_ty_1),
            "::",
            stringify!(Dpc),
        ),
    );
}
impl Default for _KWAIT_BLOCK__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__KWAIT_BLOCK() {
    const UNINIT: ::core::mem::MaybeUninit<_KWAIT_BLOCK> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_KWAIT_BLOCK>(),
        48usize,
        concat!("Size of: ", stringify!(_KWAIT_BLOCK)),
    );
    assert_eq!(
        ::core::mem::align_of::<_KWAIT_BLOCK>(),
        8usize,
        concat!("Alignment of ", stringify!(_KWAIT_BLOCK)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WaitListEntry) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_KWAIT_BLOCK),
            "::",
            stringify!(WaitListEntry),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WaitType) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_KWAIT_BLOCK),
            "::",
            stringify!(WaitType),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BlockState) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(_KWAIT_BLOCK),
            "::",
            stringify!(BlockState),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WaitKey) as usize - ptr as usize },
        18usize,
        concat!("Offset of field: ", stringify!(_KWAIT_BLOCK), "::", stringify!(WaitKey)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SpareLong) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_KWAIT_BLOCK),
            "::",
            stringify!(SpareLong),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Object) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(_KWAIT_BLOCK), "::", stringify!(Object)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SparePtr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_KWAIT_BLOCK),
            "::",
            stringify!(SparePtr),
        ),
    );
}
impl Default for _KWAIT_BLOCK {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type PKWAIT_BLOCK = *mut _KWAIT_BLOCK;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _KDEVICE_QUEUE {
    pub Type: CSHORT,
    pub Size: CSHORT,
    pub DeviceListHead: LIST_ENTRY,
    pub Lock: KSPIN_LOCK,
    pub __bindgen_anon_1: _KDEVICE_QUEUE__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _KDEVICE_QUEUE__bindgen_ty_1 {
    pub Busy: BOOLEAN,
    pub __bindgen_anon_1: _KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u64; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[test]
fn bindgen_test_layout__KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<_KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1)),
    );
}
impl _KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn Reserved(&self) -> LONG64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_Reserved(&mut self, val: LONG64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn Hint(&self) -> LONG64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 56u8) as u64) }
    }
    #[inline]
    pub fn set_Hint(&mut self, val: LONG64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 56u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        Reserved: LONG64,
        Hint: LONG64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                8u8,
                {
                    let Reserved: u64 = unsafe { ::core::mem::transmute(Reserved) };
                    Reserved as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                8usize,
                56u8,
                {
                    let Hint: u64 = unsafe { ::core::mem::transmute(Hint) };
                    Hint as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__KDEVICE_QUEUE__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_KDEVICE_QUEUE__bindgen_ty_1> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_KDEVICE_QUEUE__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_KDEVICE_QUEUE__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_KDEVICE_QUEUE__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_KDEVICE_QUEUE__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Busy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_KDEVICE_QUEUE__bindgen_ty_1),
            "::",
            stringify!(Busy),
        ),
    );
}
impl Default for _KDEVICE_QUEUE__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__KDEVICE_QUEUE() {
    const UNINIT: ::core::mem::MaybeUninit<_KDEVICE_QUEUE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_KDEVICE_QUEUE>(),
        40usize,
        concat!("Size of: ", stringify!(_KDEVICE_QUEUE)),
    );
    assert_eq!(
        ::core::mem::align_of::<_KDEVICE_QUEUE>(),
        8usize,
        concat!("Alignment of ", stringify!(_KDEVICE_QUEUE)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_KDEVICE_QUEUE), "::", stringify!(Type)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(_KDEVICE_QUEUE), "::", stringify!(Size)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DeviceListHead) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_KDEVICE_QUEUE),
            "::",
            stringify!(DeviceListHead),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Lock) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(_KDEVICE_QUEUE), "::", stringify!(Lock)),
    );
}
impl Default for _KDEVICE_QUEUE {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type KDEVICE_QUEUE = _KDEVICE_QUEUE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _KDEVICE_QUEUE_ENTRY {
    pub DeviceListEntry: LIST_ENTRY,
    pub SortKey: ULONG,
    pub Inserted: BOOLEAN,
}
#[test]
fn bindgen_test_layout__KDEVICE_QUEUE_ENTRY() {
    const UNINIT: ::core::mem::MaybeUninit<_KDEVICE_QUEUE_ENTRY> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_KDEVICE_QUEUE_ENTRY>(),
        24usize,
        concat!("Size of: ", stringify!(_KDEVICE_QUEUE_ENTRY)),
    );
    assert_eq!(
        ::core::mem::align_of::<_KDEVICE_QUEUE_ENTRY>(),
        8usize,
        concat!("Alignment of ", stringify!(_KDEVICE_QUEUE_ENTRY)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DeviceListEntry) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_KDEVICE_QUEUE_ENTRY),
            "::",
            stringify!(DeviceListEntry),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SortKey) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_KDEVICE_QUEUE_ENTRY),
            "::",
            stringify!(SortKey),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Inserted) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_KDEVICE_QUEUE_ENTRY),
            "::",
            stringify!(Inserted),
        ),
    );
}
impl Default for _KDEVICE_QUEUE_ENTRY {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type KDEVICE_QUEUE_ENTRY = _KDEVICE_QUEUE_ENTRY;
pub mod _POOL_TYPE {
    pub type Type = ::core::ffi::c_int;
    pub const NonPagedPool: Type = 0;
    pub const NonPagedPoolExecute: Type = 0;
    pub const PagedPool: Type = 1;
    pub const NonPagedPoolMustSucceed: Type = 2;
    pub const DontUseThisType: Type = 3;
    pub const NonPagedPoolCacheAligned: Type = 4;
    pub const PagedPoolCacheAligned: Type = 5;
    pub const NonPagedPoolCacheAlignedMustS: Type = 6;
    pub const MaxPoolType: Type = 7;
    pub const NonPagedPoolBase: Type = 0;
    pub const NonPagedPoolBaseMustSucceed: Type = 2;
    pub const NonPagedPoolBaseCacheAligned: Type = 4;
    pub const NonPagedPoolBaseCacheAlignedMustS: Type = 6;
    pub const NonPagedPoolSession: Type = 32;
    pub const PagedPoolSession: Type = 33;
    pub const NonPagedPoolMustSucceedSession: Type = 34;
    pub const DontUseThisTypeSession: Type = 35;
    pub const NonPagedPoolCacheAlignedSession: Type = 36;
    pub const PagedPoolCacheAlignedSession: Type = 37;
    pub const NonPagedPoolCacheAlignedMustSSession: Type = 38;
    pub const NonPagedPoolNx: Type = 512;
    pub const NonPagedPoolNxCacheAligned: Type = 516;
    pub const NonPagedPoolSessionNx: Type = 544;
}
pub mod _WORK_QUEUE_TYPE {
    pub type Type = ::core::ffi::c_int;
    pub const CriticalWorkQueue: Type = 0;
    pub const DelayedWorkQueue: Type = 1;
    pub const HyperCriticalWorkQueue: Type = 2;
    pub const NormalWorkQueue: Type = 3;
    pub const BackgroundWorkQueue: Type = 4;
    pub const RealTimeWorkQueue: Type = 5;
    pub const SuperCriticalWorkQueue: Type = 6;
    pub const MaximumWorkQueue: Type = 7;
    pub const CustomPriorityWorkQueue: Type = 32;
}
pub use self::_WORK_QUEUE_TYPE::Type as WORK_QUEUE_TYPE;
pub type ERESOURCE_THREAD = ULONG_PTR;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _OWNER_ENTRY {
    pub OwnerThread: ERESOURCE_THREAD,
    pub __bindgen_anon_1: _OWNER_ENTRY__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _OWNER_ENTRY__bindgen_ty_1 {
    pub __bindgen_anon_1: _OWNER_ENTRY__bindgen_ty_1__bindgen_ty_1,
    pub TableSize: ULONG,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _OWNER_ENTRY__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__OWNER_ENTRY__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<_OWNER_ENTRY__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_OWNER_ENTRY__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_OWNER_ENTRY__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_OWNER_ENTRY__bindgen_ty_1__bindgen_ty_1)),
    );
}
impl _OWNER_ENTRY__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn IoPriorityBoosted(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_IoPriorityBoosted(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn OwnerReferenced(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_OwnerReferenced(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn IoQoSPriorityBoosted(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_IoQoSPriorityBoosted(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn OwnerCount(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 29u8) as u32) }
    }
    #[inline]
    pub fn set_OwnerCount(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 29u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        IoPriorityBoosted: ULONG,
        OwnerReferenced: ULONG,
        IoQoSPriorityBoosted: ULONG,
        OwnerCount: ULONG,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                1u8,
                {
                    let IoPriorityBoosted: u32 = unsafe {
                        ::core::mem::transmute(IoPriorityBoosted)
                    };
                    IoPriorityBoosted as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                1usize,
                1u8,
                {
                    let OwnerReferenced: u32 = unsafe {
                        ::core::mem::transmute(OwnerReferenced)
                    };
                    OwnerReferenced as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                2usize,
                1u8,
                {
                    let IoQoSPriorityBoosted: u32 = unsafe {
                        ::core::mem::transmute(IoQoSPriorityBoosted)
                    };
                    IoQoSPriorityBoosted as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                3usize,
                29u8,
                {
                    let OwnerCount: u32 = unsafe { ::core::mem::transmute(OwnerCount) };
                    OwnerCount as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__OWNER_ENTRY__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_OWNER_ENTRY__bindgen_ty_1> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_OWNER_ENTRY__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_OWNER_ENTRY__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_OWNER_ENTRY__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_OWNER_ENTRY__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).TableSize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_OWNER_ENTRY__bindgen_ty_1),
            "::",
            stringify!(TableSize),
        ),
    );
}
impl Default for _OWNER_ENTRY__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__OWNER_ENTRY() {
    const UNINIT: ::core::mem::MaybeUninit<_OWNER_ENTRY> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_OWNER_ENTRY>(),
        16usize,
        concat!("Size of: ", stringify!(_OWNER_ENTRY)),
    );
    assert_eq!(
        ::core::mem::align_of::<_OWNER_ENTRY>(),
        8usize,
        concat!("Alignment of ", stringify!(_OWNER_ENTRY)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OwnerThread) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_OWNER_ENTRY),
            "::",
            stringify!(OwnerThread),
        ),
    );
}
impl Default for _OWNER_ENTRY {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type OWNER_ENTRY = _OWNER_ENTRY;
pub type POWNER_ENTRY = *mut _OWNER_ENTRY;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ERESOURCE {
    pub SystemResourcesList: LIST_ENTRY,
    pub OwnerTable: POWNER_ENTRY,
    pub ActiveCount: SHORT,
    pub __bindgen_anon_1: _ERESOURCE__bindgen_ty_1,
    pub SharedWaiters: PVOID,
    pub ExclusiveWaiters: PVOID,
    pub OwnerEntry: OWNER_ENTRY,
    pub ActiveEntries: ULONG,
    pub ContentionCount: ULONG,
    pub NumberOfSharedWaiters: ULONG,
    pub NumberOfExclusiveWaiters: ULONG,
    pub Reserved2: PVOID,
    pub __bindgen_anon_2: _ERESOURCE__bindgen_ty_2,
    pub SpinLock: KSPIN_LOCK,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ERESOURCE__bindgen_ty_1 {
    pub Flag: USHORT,
    pub __bindgen_anon_1: _ERESOURCE__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _ERESOURCE__bindgen_ty_1__bindgen_ty_1 {
    pub ReservedLowFlags: UCHAR,
    pub WaiterPriority: UCHAR,
}
#[test]
fn bindgen_test_layout__ERESOURCE__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_ERESOURCE__bindgen_ty_1__bindgen_ty_1> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_ERESOURCE__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(_ERESOURCE__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_ERESOURCE__bindgen_ty_1__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(_ERESOURCE__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ReservedLowFlags) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(ReservedLowFlags),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WaiterPriority) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(WaiterPriority),
        ),
    );
}
#[test]
fn bindgen_test_layout__ERESOURCE__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_ERESOURCE__bindgen_ty_1> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_ERESOURCE__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(_ERESOURCE__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_ERESOURCE__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(_ERESOURCE__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Flag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE__bindgen_ty_1),
            "::",
            stringify!(Flag),
        ),
    );
}
impl Default for _ERESOURCE__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ERESOURCE__bindgen_ty_2 {
    pub Address: PVOID,
    pub CreatorBackTraceIndex: ULONG_PTR,
}
#[test]
fn bindgen_test_layout__ERESOURCE__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<_ERESOURCE__bindgen_ty_2> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_ERESOURCE__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(_ERESOURCE__bindgen_ty_2)),
    );
    assert_eq!(
        ::core::mem::align_of::<_ERESOURCE__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(_ERESOURCE__bindgen_ty_2)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE__bindgen_ty_2),
            "::",
            stringify!(Address),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).CreatorBackTraceIndex) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE__bindgen_ty_2),
            "::",
            stringify!(CreatorBackTraceIndex),
        ),
    );
}
impl Default for _ERESOURCE__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__ERESOURCE() {
    const UNINIT: ::core::mem::MaybeUninit<_ERESOURCE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_ERESOURCE>(),
        104usize,
        concat!("Size of: ", stringify!(_ERESOURCE)),
    );
    assert_eq!(
        ::core::mem::align_of::<_ERESOURCE>(),
        8usize,
        concat!("Alignment of ", stringify!(_ERESOURCE)),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SystemResourcesList) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE),
            "::",
            stringify!(SystemResourcesList),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OwnerTable) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE),
            "::",
            stringify!(OwnerTable),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ActiveCount) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE),
            "::",
            stringify!(ActiveCount),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SharedWaiters) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE),
            "::",
            stringify!(SharedWaiters),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ExclusiveWaiters) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE),
            "::",
            stringify!(ExclusiveWaiters),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OwnerEntry) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE),
            "::",
            stringify!(OwnerEntry),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ActiveEntries) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE),
            "::",
            stringify!(ActiveEntries),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ContentionCount) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE),
            "::",
            stringify!(ContentionCount),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).NumberOfSharedWaiters) as usize - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE),
            "::",
            stringify!(NumberOfSharedWaiters),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).NumberOfExclusiveWaiters) as usize
                - ptr as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_ERESOURCE),
            "::",
            stringify!(NumberOfExclusiveWaiters),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Reserved2) as usize - ptr as usize },
        80usize,
        concat!("Offset of field: ", stringify!(_ERESOURCE), "::", stringify!(Reserved2)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SpinLock) as usize - ptr as usize },
        96usize,
        concat!("Offset of field: ", stringify!(_ERESOURCE), "::", stringify!(SpinLock)),
    );
}
impl Default for _ERESOURCE {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type PERESOURCE = *mut _ERESOURCE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_SUBJECT_CONTEXT {
    pub ClientToken: PACCESS_TOKEN,
    pub ImpersonationLevel: SECURITY_IMPERSONATION_LEVEL,
    pub PrimaryToken: PACCESS_TOKEN,
    pub ProcessAuditId: PVOID,
}
#[test]
fn bindgen_test_layout__SECURITY_SUBJECT_CONTEXT() {
    const UNINIT: ::core::mem::MaybeUninit<_SECURITY_SUBJECT_CONTEXT> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_SECURITY_SUBJECT_CONTEXT>(),
        32usize,
        concat!("Size of: ", stringify!(_SECURITY_SUBJECT_CONTEXT)),
    );
    assert_eq!(
        ::core::mem::align_of::<_SECURITY_SUBJECT_CONTEXT>(),
        8usize,
        concat!("Alignment of ", stringify!(_SECURITY_SUBJECT_CONTEXT)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ClientToken) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_SUBJECT_CONTEXT),
            "::",
            stringify!(ClientToken),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ImpersonationLevel) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_SUBJECT_CONTEXT),
            "::",
            stringify!(ImpersonationLevel),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PrimaryToken) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_SUBJECT_CONTEXT),
            "::",
            stringify!(PrimaryToken),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ProcessAuditId) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_SECURITY_SUBJECT_CONTEXT),
            "::",
            stringify!(ProcessAuditId),
        ),
    );
}
impl Default for _SECURITY_SUBJECT_CONTEXT {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type SECURITY_SUBJECT_CONTEXT = _SECURITY_SUBJECT_CONTEXT;
pub type PSECURITY_SUBJECT_CONTEXT = *mut _SECURITY_SUBJECT_CONTEXT;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _INITIAL_PRIVILEGE_SET {
    pub PrivilegeCount: ULONG,
    pub Control: ULONG,
    pub Privilege: [LUID_AND_ATTRIBUTES; 3usize],
}
#[test]
fn bindgen_test_layout__INITIAL_PRIVILEGE_SET() {
    const UNINIT: ::core::mem::MaybeUninit<_INITIAL_PRIVILEGE_SET> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_INITIAL_PRIVILEGE_SET>(),
        44usize,
        concat!("Size of: ", stringify!(_INITIAL_PRIVILEGE_SET)),
    );
    assert_eq!(
        ::core::mem::align_of::<_INITIAL_PRIVILEGE_SET>(),
        4usize,
        concat!("Alignment of ", stringify!(_INITIAL_PRIVILEGE_SET)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PrivilegeCount) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_INITIAL_PRIVILEGE_SET),
            "::",
            stringify!(PrivilegeCount),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Control) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_INITIAL_PRIVILEGE_SET),
            "::",
            stringify!(Control),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Privilege) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_INITIAL_PRIVILEGE_SET),
            "::",
            stringify!(Privilege),
        ),
    );
}
pub type INITIAL_PRIVILEGE_SET = _INITIAL_PRIVILEGE_SET;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ACCESS_STATE {
    pub OperationID: LUID,
    pub SecurityEvaluated: BOOLEAN,
    pub GenerateAudit: BOOLEAN,
    pub GenerateOnClose: BOOLEAN,
    pub PrivilegesAllocated: BOOLEAN,
    pub Flags: ULONG,
    pub RemainingDesiredAccess: ACCESS_MASK,
    pub PreviouslyGrantedAccess: ACCESS_MASK,
    pub OriginalDesiredAccess: ACCESS_MASK,
    pub SubjectSecurityContext: SECURITY_SUBJECT_CONTEXT,
    pub SecurityDescriptor: PSECURITY_DESCRIPTOR,
    pub AuxData: PVOID,
    pub Privileges: _ACCESS_STATE__bindgen_ty_1,
    pub AuditPrivileges: BOOLEAN,
    pub ObjectName: UNICODE_STRING,
    pub ObjectTypeName: UNICODE_STRING,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ACCESS_STATE__bindgen_ty_1 {
    pub InitialPrivilegeSet: INITIAL_PRIVILEGE_SET,
    pub PrivilegeSet: PRIVILEGE_SET,
}
#[test]
fn bindgen_test_layout__ACCESS_STATE__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_ACCESS_STATE__bindgen_ty_1> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_ACCESS_STATE__bindgen_ty_1>(),
        44usize,
        concat!("Size of: ", stringify!(_ACCESS_STATE__bindgen_ty_1)),
    );
    assert_eq!(
        ::core::mem::align_of::<_ACCESS_STATE__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_ACCESS_STATE__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).InitialPrivilegeSet) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE__bindgen_ty_1),
            "::",
            stringify!(InitialPrivilegeSet),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PrivilegeSet) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE__bindgen_ty_1),
            "::",
            stringify!(PrivilegeSet),
        ),
    );
}
impl Default for _ACCESS_STATE__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout__ACCESS_STATE() {
    const UNINIT: ::core::mem::MaybeUninit<_ACCESS_STATE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_ACCESS_STATE>(),
        160usize,
        concat!("Size of: ", stringify!(_ACCESS_STATE)),
    );
    assert_eq!(
        ::core::mem::align_of::<_ACCESS_STATE>(),
        8usize,
        concat!("Alignment of ", stringify!(_ACCESS_STATE)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OperationID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(OperationID),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SecurityEvaluated) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(SecurityEvaluated),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GenerateAudit) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(GenerateAudit),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).GenerateOnClose) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(GenerateOnClose),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PrivilegesAllocated) as usize - ptr as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(PrivilegesAllocated),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(_ACCESS_STATE), "::", stringify!(Flags)),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).RemainingDesiredAccess) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(RemainingDesiredAccess),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).PreviouslyGrantedAccess) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(PreviouslyGrantedAccess),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).OriginalDesiredAccess) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(OriginalDesiredAccess),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SubjectSecurityContext) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(SubjectSecurityContext),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SecurityDescriptor) as usize - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(SecurityDescriptor),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AuxData) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(AuxData),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Privileges) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(Privileges),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AuditPrivileges) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(AuditPrivileges),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ObjectName) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(ObjectName),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ObjectTypeName) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_ACCESS_STATE),
            "::",
            stringify!(ObjectTypeName),
        ),
    );
}
impl Default for _ACCESS_STATE {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _NAMED_PIPE_CREATE_PARAMETERS {
    pub NamedPipeType: ULONG,
    pub ReadMode: ULONG,
    pub CompletionMode: ULONG,
    pub MaximumInstances: ULONG,
    pub InboundQuota: ULONG,
    pub OutboundQuota: ULONG,
    pub DefaultTimeout: LARGE_INTEGER,
    pub TimeoutSpecified: BOOLEAN,
}
#[test]
fn bindgen_test_layout__NAMED_PIPE_CREATE_PARAMETERS() {
    const UNINIT: ::core::mem::MaybeUninit<_NAMED_PIPE_CREATE_PARAMETERS> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_NAMED_PIPE_CREATE_PARAMETERS>(),
        40usize,
        concat!("Size of: ", stringify!(_NAMED_PIPE_CREATE_PARAMETERS)),
    );
    assert_eq!(
        ::core::mem::align_of::<_NAMED_PIPE_CREATE_PARAMETERS>(),
        8usize,
        concat!("Alignment of ", stringify!(_NAMED_PIPE_CREATE_PARAMETERS)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).NamedPipeType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NAMED_PIPE_CREATE_PARAMETERS),
            "::",
            stringify!(NamedPipeType),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ReadMode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NAMED_PIPE_CREATE_PARAMETERS),
            "::",
            stringify!(ReadMode),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CompletionMode) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NAMED_PIPE_CREATE_PARAMETERS),
            "::",
            stringify!(CompletionMode),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MaximumInstances) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NAMED_PIPE_CREATE_PARAMETERS),
            "::",
            stringify!(MaximumInstances),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).InboundQuota) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NAMED_PIPE_CREATE_PARAMETERS),
            "::",
            stringify!(InboundQuota),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).OutboundQuota) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_NAMED_PIPE_CREATE_PARAMETERS),
            "::",
            stringify!(OutboundQuota),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DefaultTimeout) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NAMED_PIPE_CREATE_PARAMETERS),
            "::",
            stringify!(DefaultTimeout),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TimeoutSpecified) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_NAMED_PIPE_CREATE_PARAMETERS),
            "::",
            stringify!(TimeoutSpecified),
        ),
    );
}
impl Default for _NAMED_PIPE_CREATE_PARAMETERS {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type PNAMED_PIPE_CREATE_PARAMETERS = *mut _NAMED_PIPE_CREATE_PARAMETERS;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _MAILSLOT_CREATE_PARAMETERS {
    pub MailslotQuota: ULONG,
    pub MaximumMessageSize: ULONG,
    pub ReadTimeout: LARGE_INTEGER,
    pub TimeoutSpecified: BOOLEAN,
}
#[test]
fn bindgen_test_layout__MAILSLOT_CREATE_PARAMETERS() {
    const UNINIT: ::core::mem::MaybeUninit<_MAILSLOT_CREATE_PARAMETERS> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_MAILSLOT_CREATE_PARAMETERS>(),
        24usize,
        concat!("Size of: ", stringify!(_MAILSLOT_CREATE_PARAMETERS)),
    );
    assert_eq!(
        ::core::mem::align_of::<_MAILSLOT_CREATE_PARAMETERS>(),
        8usize,
        concat!("Alignment of ", stringify!(_MAILSLOT_CREATE_PARAMETERS)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MailslotQuota) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_MAILSLOT_CREATE_PARAMETERS),
            "::",
            stringify!(MailslotQuota),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MaximumMessageSize) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_MAILSLOT_CREATE_PARAMETERS),
            "::",
            stringify!(MaximumMessageSize),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ReadTimeout) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_MAILSLOT_CREATE_PARAMETERS),
            "::",
            stringify!(ReadTimeout),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).TimeoutSpecified) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_MAILSLOT_CREATE_PARAMETERS),
            "::",
            stringify!(TimeoutSpecified),
        ),
    );
}
impl Default for _MAILSLOT_CREATE_PARAMETERS {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type PMAILSLOT_CREATE_PARAMETERS = *mut _MAILSLOT_CREATE_PARAMETERS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCSI_REQUEST_BLOCK {
    _unused: [u8; 0],
}
pub type DRIVER_INITIALIZE = ::core::option::Option<
    unsafe extern "C" fn(
        DriverObject: *mut _DRIVER_OBJECT,
        RegistryPath: PUNICODE_STRING,
    ) -> NTSTATUS,
>;
pub type PDRIVER_INITIALIZE = DRIVER_INITIALIZE;
pub type DRIVER_CANCEL = ::core::option::Option<
    unsafe extern "C" fn(DeviceObject: *mut _DEVICE_OBJECT, Irp: *mut _IRP),
>;
pub type PDRIVER_CANCEL = DRIVER_CANCEL;
pub type DRIVER_DISPATCH = ::core::option::Option<
    unsafe extern "C" fn(DeviceObject: *mut _DEVICE_OBJECT, Irp: *mut _IRP) -> NTSTATUS,
>;
pub type PDRIVER_DISPATCH = DRIVER_DISPATCH;
pub type DRIVER_STARTIO = ::core::option::Option<
    unsafe extern "C" fn(DeviceObject: *mut _DEVICE_OBJECT, Irp: *mut _IRP),
>;
pub type PDRIVER_STARTIO = DRIVER_STARTIO;
pub type DRIVER_UNLOAD = ::core::option::Option<
    unsafe extern "C" fn(DriverObject: *mut _DRIVER_OBJECT),
>;
pub type PDRIVER_UNLOAD = DRIVER_UNLOAD;
pub type DRIVER_ADD_DEVICE = ::core::option::Option<
    unsafe extern "C" fn(
        DriverObject: *mut _DRIVER_OBJECT,
        PhysicalDeviceObject: *mut _DEVICE_OBJECT,
    ) -> NTSTATUS,
>;
pub type PDRIVER_ADD_DEVICE = DRIVER_ADD_DEVICE;
pub type FAST_IO_CHECK_IF_POSSIBLE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: ULONG,
        Wait: BOOLEAN,
        LockKey: ULONG,
        CheckForReadOperation: BOOLEAN,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_CHECK_IF_POSSIBLE = FAST_IO_CHECK_IF_POSSIBLE;
pub type FAST_IO_READ = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: ULONG,
        Wait: BOOLEAN,
        LockKey: ULONG,
        Buffer: PVOID,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_READ = FAST_IO_READ;
pub type FAST_IO_WRITE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: ULONG,
        Wait: BOOLEAN,
        LockKey: ULONG,
        Buffer: PVOID,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_WRITE = FAST_IO_WRITE;
pub type FAST_IO_QUERY_BASIC_INFO = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        Wait: BOOLEAN,
        Buffer: PFILE_BASIC_INFORMATION,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_QUERY_BASIC_INFO = FAST_IO_QUERY_BASIC_INFO;
pub type FAST_IO_QUERY_STANDARD_INFO = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        Wait: BOOLEAN,
        Buffer: PFILE_STANDARD_INFORMATION,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_QUERY_STANDARD_INFO = FAST_IO_QUERY_STANDARD_INFO;
pub type FAST_IO_LOCK = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: PLARGE_INTEGER,
        ProcessId: PEPROCESS,
        Key: ULONG,
        FailImmediately: BOOLEAN,
        ExclusiveLock: BOOLEAN,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_LOCK = FAST_IO_LOCK;
pub type FAST_IO_UNLOCK_SINGLE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: PLARGE_INTEGER,
        ProcessId: PEPROCESS,
        Key: ULONG,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_UNLOCK_SINGLE = FAST_IO_UNLOCK_SINGLE;
pub type FAST_IO_UNLOCK_ALL = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        ProcessId: PEPROCESS,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_UNLOCK_ALL = FAST_IO_UNLOCK_ALL;
pub type FAST_IO_UNLOCK_ALL_BY_KEY = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        ProcessId: PVOID,
        Key: ULONG,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_UNLOCK_ALL_BY_KEY = FAST_IO_UNLOCK_ALL_BY_KEY;
pub type FAST_IO_DEVICE_CONTROL = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        Wait: BOOLEAN,
        InputBuffer: PVOID,
        InputBufferLength: ULONG,
        OutputBuffer: PVOID,
        OutputBufferLength: ULONG,
        IoControlCode: ULONG,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_DEVICE_CONTROL = FAST_IO_DEVICE_CONTROL;
pub type FAST_IO_ACQUIRE_FILE = ::core::option::Option<
    unsafe extern "C" fn(FileObject: *mut _FILE_OBJECT),
>;
pub type PFAST_IO_ACQUIRE_FILE = FAST_IO_ACQUIRE_FILE;
pub type FAST_IO_RELEASE_FILE = ::core::option::Option<
    unsafe extern "C" fn(FileObject: *mut _FILE_OBJECT),
>;
pub type PFAST_IO_RELEASE_FILE = FAST_IO_RELEASE_FILE;
pub type FAST_IO_DETACH_DEVICE = ::core::option::Option<
    unsafe extern "C" fn(
        SourceDevice: *mut _DEVICE_OBJECT,
        TargetDevice: *mut _DEVICE_OBJECT,
    ),
>;
pub type PFAST_IO_DETACH_DEVICE = FAST_IO_DETACH_DEVICE;
pub type FAST_IO_QUERY_NETWORK_OPEN_INFO = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        Wait: BOOLEAN,
        Buffer: *mut _FILE_NETWORK_OPEN_INFORMATION,
        IoStatus: *mut _IO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_QUERY_NETWORK_OPEN_INFO = FAST_IO_QUERY_NETWORK_OPEN_INFO;
pub type FAST_IO_MDL_READ = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: ULONG,
        LockKey: ULONG,
        MdlChain: *mut PMDL,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_MDL_READ = FAST_IO_MDL_READ;
pub type FAST_IO_MDL_READ_COMPLETE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        MdlChain: PMDL,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_MDL_READ_COMPLETE = FAST_IO_MDL_READ_COMPLETE;
pub type FAST_IO_PREPARE_MDL_WRITE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: ULONG,
        LockKey: ULONG,
        MdlChain: *mut PMDL,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_PREPARE_MDL_WRITE = FAST_IO_PREPARE_MDL_WRITE;
pub type FAST_IO_MDL_WRITE_COMPLETE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        MdlChain: PMDL,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_MDL_WRITE_COMPLETE = FAST_IO_MDL_WRITE_COMPLETE;
pub type FAST_IO_ACQUIRE_FOR_MOD_WRITE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        EndingOffset: PLARGE_INTEGER,
        ResourceToRelease: *mut *mut _ERESOURCE,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> NTSTATUS,
>;
pub type PFAST_IO_ACQUIRE_FOR_MOD_WRITE = FAST_IO_ACQUIRE_FOR_MOD_WRITE;
pub type FAST_IO_RELEASE_FOR_MOD_WRITE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        ResourceToRelease: *mut _ERESOURCE,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> NTSTATUS,
>;
pub type PFAST_IO_RELEASE_FOR_MOD_WRITE = FAST_IO_RELEASE_FOR_MOD_WRITE;
pub type FAST_IO_ACQUIRE_FOR_CCFLUSH = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> NTSTATUS,
>;
pub type PFAST_IO_ACQUIRE_FOR_CCFLUSH = FAST_IO_ACQUIRE_FOR_CCFLUSH;
pub type FAST_IO_RELEASE_FOR_CCFLUSH = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> NTSTATUS,
>;
pub type PFAST_IO_RELEASE_FOR_CCFLUSH = FAST_IO_RELEASE_FOR_CCFLUSH;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _COMPRESSED_DATA_INFO {
    _unused: [u8; 0],
}
pub type FAST_IO_READ_COMPRESSED = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: ULONG,
        LockKey: ULONG,
        Buffer: PVOID,
        MdlChain: *mut PMDL,
        IoStatus: PIO_STATUS_BLOCK,
        CompressedDataInfo: *mut _COMPRESSED_DATA_INFO,
        CompressedDataInfoLength: ULONG,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_READ_COMPRESSED = FAST_IO_READ_COMPRESSED;
pub type FAST_IO_WRITE_COMPRESSED = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: ULONG,
        LockKey: ULONG,
        Buffer: PVOID,
        MdlChain: *mut PMDL,
        IoStatus: PIO_STATUS_BLOCK,
        CompressedDataInfo: *mut _COMPRESSED_DATA_INFO,
        CompressedDataInfoLength: ULONG,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_WRITE_COMPRESSED = FAST_IO_WRITE_COMPRESSED;
pub type FAST_IO_MDL_READ_COMPLETE_COMPRESSED = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        MdlChain: PMDL,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_MDL_READ_COMPLETE_COMPRESSED = FAST_IO_MDL_READ_COMPLETE_COMPRESSED;
pub type FAST_IO_MDL_WRITE_COMPLETE_COMPRESSED = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        MdlChain: PMDL,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_MDL_WRITE_COMPLETE_COMPRESSED = FAST_IO_MDL_WRITE_COMPLETE_COMPRESSED;
pub type FAST_IO_QUERY_OPEN = ::core::option::Option<
    unsafe extern "C" fn(
        Irp: *mut _IRP,
        NetworkInformation: PFILE_NETWORK_OPEN_INFORMATION,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_QUERY_OPEN = FAST_IO_QUERY_OPEN;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _FAST_IO_DISPATCH {
    pub SizeOfFastIoDispatch: ULONG,
    pub FastIoCheckIfPossible: PFAST_IO_CHECK_IF_POSSIBLE,
    pub FastIoRead: PFAST_IO_READ,
    pub FastIoWrite: PFAST_IO_WRITE,
    pub FastIoQueryBasicInfo: PFAST_IO_QUERY_BASIC_INFO,
    pub FastIoQueryStandardInfo: PFAST_IO_QUERY_STANDARD_INFO,
    pub FastIoLock: PFAST_IO_LOCK,
    pub FastIoUnlockSingle: PFAST_IO_UNLOCK_SINGLE,
    pub FastIoUnlockAll: PFAST_IO_UNLOCK_ALL,
    pub FastIoUnlockAllByKey: PFAST_IO_UNLOCK_ALL_BY_KEY,
    pub FastIoDeviceControl: PFAST_IO_DEVICE_CONTROL,
    pub AcquireFileForNtCreateSection: PFAST_IO_ACQUIRE_FILE,
    pub ReleaseFileForNtCreateSection: PFAST_IO_RELEASE_FILE,
    pub FastIoDetachDevice: PFAST_IO_DETACH_DEVICE,
    pub FastIoQueryNetworkOpenInfo: PFAST_IO_QUERY_NETWORK_OPEN_INFO,
    pub AcquireForModWrite: PFAST_IO_ACQUIRE_FOR_MOD_WRITE,
    pub MdlRead: PFAST_IO_MDL_READ,
    pub MdlReadComplete: PFAST_IO_MDL_READ_COMPLETE,
    pub PrepareMdlWrite: PFAST_IO_PREPARE_MDL_WRITE,
    pub MdlWriteComplete: PFAST_IO_MDL_WRITE_COMPLETE,
    pub FastIoReadCompressed: PFAST_IO_READ_COMPRESSED,
    pub FastIoWriteCompressed: PFAST_IO_WRITE_COMPRESSED,
    pub MdlReadCompleteCompressed: PFAST_IO_MDL_READ_COMPLETE_COMPRESSED,
    pub MdlWriteCompleteCompressed: PFAST_IO_MDL_WRITE_COMPLETE_COMPRESSED,
    pub FastIoQueryOpen: PFAST_IO_QUERY_OPEN,
    pub ReleaseForModWrite: PFAST_IO_RELEASE_FOR_MOD_WRITE,
    pub AcquireForCcFlush: PFAST_IO_ACQUIRE_FOR_CCFLUSH,
    pub ReleaseForCcFlush: PFAST_IO_RELEASE_FOR_CCFLUSH,
}
#[test]
fn bindgen_test_layout__FAST_IO_DISPATCH() {
    const UNINIT: ::core::mem::MaybeUninit<_FAST_IO_DISPATCH> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_FAST_IO_DISPATCH>(),
        224usize,
        concat!("Size of: ", stringify!(_FAST_IO_DISPATCH)),
    );
    assert_eq!(
        ::core::mem::align_of::<_FAST_IO_DISPATCH>(),
        8usize,
        concat!("Alignment of ", stringify!(_FAST_IO_DISPATCH)),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).SizeOfFastIoDispatch) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(SizeOfFastIoDispatch),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FastIoCheckIfPossible) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoCheckIfPossible),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FastIoRead) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoRead),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FastIoWrite) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoWrite),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FastIoQueryBasicInfo) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoQueryBasicInfo),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FastIoQueryStandardInfo) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoQueryStandardInfo),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FastIoLock) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoLock),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FastIoUnlockSingle) as usize - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoUnlockSingle),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FastIoUnlockAll) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoUnlockAll),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FastIoUnlockAllByKey) as usize - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoUnlockAllByKey),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FastIoDeviceControl) as usize - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoDeviceControl),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AcquireFileForNtCreateSection) as usize
                - ptr as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(AcquireFileForNtCreateSection),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ReleaseFileForNtCreateSection) as usize
                - ptr as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(ReleaseFileForNtCreateSection),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FastIoDetachDevice) as usize - ptr as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoDetachDevice),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FastIoQueryNetworkOpenInfo) as usize
                - ptr as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoQueryNetworkOpenInfo),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AcquireForModWrite) as usize - ptr as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(AcquireForModWrite),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MdlRead) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(MdlRead),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MdlReadComplete) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(MdlReadComplete),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PrepareMdlWrite) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(PrepareMdlWrite),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MdlWriteComplete) as usize - ptr as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(MdlWriteComplete),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FastIoReadCompressed) as usize - ptr as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoReadCompressed),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FastIoWriteCompressed) as usize - ptr as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoWriteCompressed),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MdlReadCompleteCompressed) as usize
                - ptr as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(MdlReadCompleteCompressed),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).MdlWriteCompleteCompressed) as usize
                - ptr as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(MdlWriteCompleteCompressed),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FastIoQueryOpen) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(FastIoQueryOpen),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ReleaseForModWrite) as usize - ptr as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(ReleaseForModWrite),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).AcquireForCcFlush) as usize - ptr as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(AcquireForCcFlush),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ReleaseForCcFlush) as usize - ptr as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_FAST_IO_DISPATCH),
            "::",
            stringify!(ReleaseForCcFlush),
        ),
    );
}
pub type PFAST_IO_DISPATCH = *mut _FAST_IO_DISPATCH;
pub mod _IO_ALLOCATION_ACTION {
    pub type Type = ::core::ffi::c_int;
    pub const KeepObject: Type = 1;
    pub const DeallocateObject: Type = 2;
    pub const DeallocateObjectKeepRegisters: Type = 3;
}
pub use self::_IO_ALLOCATION_ACTION::Type as IO_ALLOCATION_ACTION;
pub type DRIVER_CONTROL = ::core::option::Option<
    unsafe extern "C" fn(
        DeviceObject: *mut _DEVICE_OBJECT,
        Irp: *mut _IRP,
        MapRegisterBase: PVOID,
        Context: PVOID,
    ) -> IO_ALLOCATION_ACTION,
>;
pub type PDRIVER_CONTROL = DRIVER_CONTROL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_SECURITY_CONTEXT {
    pub SecurityQos: PSECURITY_QUALITY_OF_SERVICE,
    pub AccessState: PACCESS_STATE,
    pub DesiredAccess: ACCESS_MASK,
    pub FullCreateOptions: ULONG,
}
#[test]
fn bindgen_test_layout__IO_SECURITY_CONTEXT() {
    const UNINIT: ::core::mem::MaybeUninit<_IO_SECURITY_CONTEXT> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_SECURITY_CONTEXT>(),
        24usize,
        concat!("Size of: ", stringify!(_IO_SECURITY_CONTEXT)),
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_SECURITY_CONTEXT>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_SECURITY_CONTEXT)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SecurityQos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_SECURITY_CONTEXT),
            "::",
            stringify!(SecurityQos),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AccessState) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_SECURITY_CONTEXT),
            "::",
            stringify!(AccessState),
        ),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DesiredAccess) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_SECURITY_CONTEXT),
            "::",
            stringify!(DesiredAccess),
        ),
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FullCreateOptions) as usize - ptr as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_SECURITY_CONTEXT),
            "::",
            stringify!(FullCreateOptions),
        ),
    );
}
impl Default for _IO_SECURITY_CONTEXT {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type PIO_SECURITY_CONTEXT = *mut _IO_SECURITY_CONTEXT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VPB {
    pub Type: CSHORT,
    pub Size: CSHORT,
    pub Flags: USHORT,
    pub VolumeLabelLength: USHORT,
    pub DeviceObject: *mut _DEVICE_OBJECT,
    pub RealDevice: *mut _DEVICE_OBJECT,
    pub SerialNumber: ULONG,
    pub ReferenceCount: ULONG,
    pub VolumeLabel: [WCHAR; 32usize],
}
#[test]
fn bindgen_test_layout__VPB() {
    const UNINIT: ::core::mem::MaybeUninit<_VPB> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_VPB>(),
        96usize,
        concat!("Size of: ", stringify!(_VPB)),
    );
    assert_eq!(
        ::core::mem::align_of::<_VPB>(),
        8usize,
        concat!("Alignment of ", stringify!(_VPB)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_VPB), "::", stringify!(Type)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(_VPB), "::", stringify!(Size)),
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(_VPB), "::", stringify!(Flags)),
    );
    assert_eq!(
        unsafe {
